import 'object.dart';

double factor = 0.3;
String tabName = '莊子通覽圖';
List<PopImage> popImages = [
  // ### 1. 逍遙遊子
  PopImage(
    980,
    150,
    210,
    100,
    'reference/1-1.jpeg',
    '逍遙遊子 - 逍遙似巨棚展翅天際',
    '北海有大魚名鯤，乘六月大風，奮力一躍為巨鵬，擊水汗順風而行九萬里，背風，奔于風之止',
  ),
  PopImage(
    980,
    255,
    210,
    80,
    'reference/1-2.jpeg',
    '逍遙遊子 - 逍遙似列子御風而行',
    '列子乘天地之延御風而行冷然善也以遊無窮，句有五日而後返',
  ),
  PopImage(
    980,
    340,
    210,
    130,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
  ),
  PopImage(
    1200,
    150,
    200,
    45,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
  ),
  PopImage(
    1200,
    198,
    200,
    135,
    'reference/1-4.jpeg',
    '逍遙遊子 - 逍遙似許由不受天下',
    '堯欲讓天下于許由。許由說：「天下在你治理下以安定了，我來代替你是位著名嗎?」小鳥築巢所需不過一支，晏鼠飲水所需不過滿腹。我要天下做什麼?',
  ),

  // ### 2. 莊子心性
  PopImage(
    540,
    115,
    190,
    80,
    'reference/2-1.jpg',
    '莊子心性 - 入故無情',
    '',
  ),
  PopImage(
    540,
    200,
    190,
    185,
    'reference/2-2.jpg',
    '莊子心性 - 得斗升之水然活',
    '',
  ),
  PopImage(
    540,
    390,
    190,
    115,
    'reference/2-3.jpg',
    '莊子心性 - 生而曳尾于塗中',
    '',
  ),
  PopImage(
    745,
    115,
    190,
    130,
    'reference/2-4.png',
    '莊子心性 - 物化',
    '',
  ),
  PopImage(
    745,
    250,
    190,
    90,
    'reference/2-5.jpeg',
    '莊子心性 - 生死為四時行',
    '',
  ),
  PopImage(
    745,
    343,
    190,
    100,
    'reference/2-6.jpg',
    '莊子心性 - 以天地為棺槨',
    '',
  ),

  // ### 3. 孔老之辯
  PopImage(
    1440,
    140,
    400,
    44,
    'reference/3-1.jpg',
    '孔老之辯 - 忘物忘天忘己',
    '',
  ),
  PopImage(
    1440,
    187,
    400,
    80,
    'reference/3-2.jpg',
    '孔老之辯 - 放德而行',
    '',
  ),
  PopImage(
    1440,
    270,
    400,
    60,
    'reference/3-3.jpg',
    '孔老之辯 - 逍遙苟簡不貸',
    '',
  ),
  PopImage(
    1440,
    332,
    400,
    60,
    'reference/3-4.jpg',
    '孔老之辯 - 三皇五帝之辯',
    '',
  ),
  PopImage(
    1440,
    395,
    400,
    50,
    'reference/3-5.jpg',
    '孔老之辯 - 六經之辯',
    '',
  ),
  PopImage(
    1440,
    448,
    400,
    55,
    'reference/3-6.jpg',
    '孔老之辯 - 至美至樂',
    '',
  ),

  // ### 4. 遊心
  PopImage(
    990,
    600,
    400,
    70,
    'reference/4-1.jpg',
    '遊心 - 齊物我',
    '',
  ),
  PopImage(
    990,
    675,
    400,
    135,
    'reference/4-2.jpg',
    '遊心 - 齊譽非',
    '',
  ),
  PopImage(
    990,
    815,
    400,
    105,
    'reference/4-3.jpg',
    '遊心 - 齊禍福',
    '',
  ),
  PopImage(
    990,
    925,
    400,
    70,
    'reference/4-4.jpg',
    '遊心 - 齊生死',
    '',
  ),

  // ### 5. 無名
  PopImage(
    540,
    600,
    400,
    108,
    'reference/5-1.jpeg',
    '無名 - 為善無近名',
    '',
  ),
  PopImage(
    540,
    740,
    400,
    68,
    'reference/5-2.jpeg',
    '無名 - 為混沌開七竅',
    '',
  ),
  PopImage(
    540,
    810,
    400,
    68,
    'reference/5-3.jpeg',
    '無名 - 殉利殉名殉家殉天下',
    '',
  ),
  PopImage(
    540,
    880,
    400,
    90,
    'reference/5-4.jpeg',
    '無名 - 忠未必信孝未必愛',
    '',
  ),

  // ### 6. 無功
  PopImage(
    1440,
    600,
    400,
    110,
    'reference/6-1.jpg',
    '無功 - 無欲而天下足',
    '',
  ),
  PopImage(
    1440,
    715,
    400,
    145,
    'reference/6-2.jpg',
    '無功 - 無為而萬物化',
    '',
  ),
  PopImage(
    1440,
    865,
    400,
    40,
    'reference/6-3.jpg',
    '無功 - 淵靜而百姓定',
    '',
  ),
  PopImage(
    1440,
    915,
    400,
    80,
    'reference/6-4.jpg',
    '無功 - 外化而內不化',
    '',
  ),

  // ### 7. 大美不言
  PopImage(
    1885,
    325,
    355,
    80,
    'reference/7-1.png',
    '大美不言 - 天地有大美而不言',
    '',
  ),
  PopImage(
    1885,
    410,
    355,
    80,
    'reference/7-2.jpeg',
    '大美不言 - 大言不辯',
    '',
  ),
  PopImage(
    1885,
    495,
    355,
    55,
    'reference/7-3.jpeg',
    '大美不言 - 大同無已',
    '',
  ),
  PopImage(
    1885,
    555,
    355,
    60,
    'reference/7-4.jpeg',
    '大美不言 - 黑鳥白鳥',
    '',
  ),
  PopImage(
    1885,
    620,
    355,
    70,
    'reference/7-5.jpeg',
    '大美不言 - 治之過也',
    '',
  ),
  PopImage(
    1885,
    700,
    355,
    100,
    'reference/7-6.jpeg',
    '大美不言 - 道何在',
    '',
  ),

  // ### 8. 棄聖止之
  PopImage(
    1885,
    970,
    355,
    80,
    'reference/8-1.jpeg',
    '棄聖止之 - 棄聖智天下平',
    '',
  ),
  PopImage(
    1885,
    1055,
    355,
    80,
    'reference/8-2.jpeg',
    '棄聖止之 - 使天下忘我難',
    '',
  ),
  PopImage(
    1885,
    1140,
    355,
    50,
    'reference/8-3.jpeg',
    '棄聖止之 - 井底蛙',
    '',
  ),
  PopImage(
    1885,
    1195,
    355,
    60,
    'reference/8-4.jpeg',
    '棄聖止之 - 知所為',
    '',
  ),
  PopImage(
    1885,
    1260,
    355,
    38,
    'reference/8-5.jpeg',
    '棄聖止之 - 知所損',
    '',
  ),
  PopImage(
    1885,
    1300,
    355,
    60,
    'reference/8-6.jpeg',
    '棄聖止之 - 知無用',
    '',
  ),

  // ### 9. 心齋坐忘
  PopImage(
    600,
    1130,
    230,
    140,
    'reference/9-1.jpg',
    '心齋坐忘 - 心智專一用心不用耳',
    '',
  ),
  PopImage(
    600,
    1275,
    230,
    100,
    'reference/9-2.jpg',
    '心齋坐忘 - 空明容物用氣不用心',
    '',
  ),
  PopImage(
    600,
    1395,
    230,
    100,
    'reference/9-3.jpg',
    '心齋坐忘 - 人間世',
    '',
  ),
  PopImage(
    840,
    1130,
    250,
    60,
    'reference/9-4.jpg',
    '心齋坐忘 - 顔回坐忘',
    '',
  ),
  PopImage(
    840,
    1195,
    250,
    110,
    'reference/9-5.jpg',
    '心齋坐忘 - 忘欲忘知',
    '',
  ),
  PopImage(
    840,
    1320,
    250,
    90,
    'reference/9-6.jpg',
    '心齋坐忘 - 忘己忘治',
    '',
  ),

  // ### 10. 六步六境
  PopImage(
    1240,
    1130,
    280,
    75,
    'reference/10-1.jpg',
    '六步六境 - 適性不忘本',
    '',
  ),
  PopImage(
    1240,
    1210,
    280,
    130,
    'reference/10-2.jpg',
    '六步六境 - 喜怒不入心',
    '',
  ),
  PopImage(
    1240,
    1345,
    280,
    90,
    'reference/10-3.jpg',
    '六步六境 - 萬物一体侍',
    '',
  ),
  PopImage(
    1525,
    1130,
    280,
    110,
    'reference/10-4.jpg',
    '六步六境 - 死生不為擾',
    '',
  ),
  PopImage(
    1525,
    1245,
    280,
    130,
    'reference/10-5.jpg',
    '六步六境 - 禍福不足憂',
    '',
  ),
  PopImage(
    1525,
    1380,
    280,
    85,
    'reference/10-6.jpg',
    '六步六境 - 逍遙自由身',
    '',
  ),

  // ### 11. 無為守本
  PopImage(
    140,
    410,
    340,
    60,
    'reference/11-1.jpg',
    '無為守本 - 不要不自量力',
    '',
  ),
  PopImage(
    140,
    475,
    340,
    70,
    'reference/11-2.jpg',
    '無為守本 - 不要違本性',
    '',
  ),
  PopImage(
    140,
    550,
    340,
    70,
    'reference/11-3.jpeg',
    '無為守本 - 不要溺愛',
    '',
  ),
  PopImage(
    140,
    625,
    340,
    80,
    'reference/11-4.jpeg',
    '無為守本 - 無功不受祿',
    '',
  ),
  PopImage(
    140,
    710,
    340,
    42,
    'reference/11-5.jpeg',
    '無為守本 - 聖人亡人國而不失人心',
    '',
  ),
  PopImage(
    140,
    755,
    340,
    70,
    'reference/11-6.jpeg',
    '無為守本 - 聖人觀予天下而不助',
    '',
  ),

  // ### 12. 三劍四患
  PopImage(
    140,
    1000,
    340,
    210,
    'reference/12-1.jpeg',
    '三劍四患 - 三劍三戰',
    '',
  ),
  PopImage(
    140,
    1213,
    340,
    83,
    'reference/12-2.jpeg',
    '三劍四患 - 識人九要',
    '',
  ),
  PopImage(
    140,
    1300,
    340,
    90,
    'reference/12-3.jpeg',
    '三劍四患 - 八病',
    '',
  ),
  PopImage(
    140,
    1393,
    340,
    75,
    'reference/12-4.jpeg',
    '三劍四患 - 四患',
    '',
  ),
];

/* 參考標題
1. 消遙遊子
1.1 逍遙似巨棚展翅天際
1.2 逍遙似列子御風而行
1.3 逍遙似姑射山神人游乎四海
1.4 逍遙似許由不受天下

2. 莊子心性
2.1 入故無情
2.2 得斗升之水然活
2.3 生而曳尾于塗中
2.4 物化
2.5 生死為四時行
2.6 以天地為棺槨

3. 孔老之辯
3.1 忘物忘天忘己
3.2 放德而行
3.3 逍遙苟簡不貸
3.4 三皇五帝之辯
3.5 六經之辯
3.6 至美至樂

4. 遊心
4.1 齊物我
4.2 齊譽非
4.3 齊禍福
4.4 齊生死

5. 無名
5.1 為善無近名
5.2 為混沌開七竅
5.3 殉利殉名殉家殉天下
5.4 忠未必信孝未必愛

6. 無功
6.1 無欲而天下足
6.2 無為而萬物化
6.3 淵靜而百姓定
6.4 外化而內不化

7. 大美不言
7.1 天地有大美而不言
7.2 大言不辯
7.3 大同無已
7.4 黑鳥白鳥
7.5 治之過也
7.6 道何在

8. 棄聖止之
8.1 棄聖智天下平
8.2 使天下忘我難
8.3 井底蛙
8.4 知所為
8.5 知所損
8.6 知無用

9. 心齋坐忘
9.1 心智專一用心不用耳
9.2 空明容物用氣不用心
9.3 人間世
9.4 顔回坐忘
9.5 忘欲忘知
9.6 忘己忘治

10. 六步六境
10.1 適性不忘本
10.2 喜怒不入心
10.3 萬物一体侍
10.4 死生不為擾
10.5 禍福不足憂
10.6 逍遙自由身
10.7 朝彻見獨

11. 無為守本
11.1 不要不自量力
11.2 不要違本性
11.3 不要溺愛
11.4 無功不受祿
11.5 聖人亡人國而不失人心
11.6 聖人觀予天下而不助

12. 三劍四患
12.1 三劍三戰
12.2 識人九要
12.3 八病
12.4 四患
*/
