import 'object.dart';

double factor = 0.3;
String tabName = '莊子通覽圖';
List<PopImage> popImages = [
  // ### 1. 逍遙遊子
  PopImage(
    980,
    150,
    210,
    100,
    'reference/1-1.jpeg',
    '逍遙遊子 - 逍遙似巨棚展翅天際',
    '北海有大魚名鯤，乘六月大風，奮力一躍為巨鵬，擊水汗順風而行九萬里，背風，奔于風之止',
    """在北海深處，有一條名叫鯤的大魚，身形巨大，成群結隊在海底遨游。每當到了六月，北海上空總是刮著強勁的大風，掀起了巨浪，讓海洋煥發出壯闊的氣勢。
而這時的鯤魚，卻是其最為活躍的時候。它們會趁著這股大風，奮力一躍，化作了一隻巨大的鵬鳥，展翅飛翔於天際。在這風起雲湧的六月之夜，它們帶著驚人的力量，翱翔九萬里遠，穿越過山川大河，越過了無盡的大海，直至風之止。
像鯤魚在逆境中一樣，我們可以發揮出驚人的力量和能力。只要努力奮鬥，克服困難，就能夠戰勝逆風，達到遠大的目標。""",
  ),
  PopImage(
    980,
    255,
    210,
    80,
    'reference/1-2.jpeg',
    '逍遙遊子 - 逍遙似列子御風而行',
    '列子乘天地之延御風而行冷然善也以遊無窮，句有五日而後返',
    """一位名叫列子的智者，他對於天地的運行和自然的法則有著非凡的洞察力。有一天，他帶著一顆平靜的心，乘著天地的延續力，御風而行，展開了一場奇妙的冒險之旅。
列子身著一袭淡青色的衣袍，面無表情，如同一塊冰雪，與風優雅地舞動。他隨著風的方向，穿越著山川河流，穿梭在雲霧之間，體驗著自然界的奇妙之處。
他看到了大地的壯麗景色，感受到了風的呼嘯聲，領略了水的柔情。在這無窮無盡的空間中，他感受到了生命的美好和宇宙的神奇。
經過五天的旅行，列子終於返回了原來的地方。雖然旅途艱辛，但他心中充滿了對於自然的敬畏和對於生命的感悟。
如果我們能夠保持一顆平靜的心，順應自然的力量，就能夠征服困難，達到目的地。""",
  ),
  PopImage(
    980,
    340,
    210,
    130,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
    """在藐姑射山的深處有一位仙人，人們稱他為藐姑射神人。他的身形優雅，肌膚如同冰雪一般晶瑩剔透，綽約婀娜如同處子。他不參食五穀，而是靠吸收風和露水來維持生命。
這位神人擁有著非凡的力量和神通，他可以乘著雲氣飛行，御使飛龍，遊歷於天地間的奇幻之境。他穿梭於山川之間，飛越大海，探尋著世界的奧秘。
人們對於藐姑射神人的故事充滿了神秘和崇敬，他被視為是仙界的使者，代表著祥和與美好。""",
  ),
  PopImage(
    1200,
    150,
    200,
    45,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
    """從前，堯帝欲將天下轉交給許由，但許由心存疑慮。他問：“天下在你治理下已經安定，那我來接替你又有何名分呢？”堯帝聽後，並不生氣，而是微笑著回答道：“小鳥築巢所需不過一枝，晏鼠飲水所需不過滿腹。我要你做的就是這樣簡單。” 於是，許由心懷感激，接受了堯帝的重托，繼續為國家和人民奉獻自己的力量。
這個故事表達了一種謙虛和知足的態度，即使承擔的責任看似簡單，但其重要性卻不容忽視。""",
  ),
  PopImage(
    1200,
    198,
    200,
    135,
    'reference/1-4.jpeg',
    '逍遙遊子 - 逍遙似許由不受天下',
    '堯欲讓天下于許由。許由說：「天下在你治理下以安定了，我來代替你是位著名嗎?」小鳥築巢所需不過一支，晏鼠飲水所需不過滿腹。我要天下做什麼?',
    """從前有一個叫做柳飛的年輕人，他常常以無情自居，認為感情只會帶來煩惱。有一天，村子裡來了一位神秘的賣藝人，他能預測人們的命運。當他遇見柳飛時，神色凝重地對他說：「你的心中充滿了冷漠，但這無情的心終究會成為你最深的傷痕。」柳飛聽了不以為然，覺得自己堅強無比。然而，時間流逝，他漸漸發現自己孤獨而空虛，沒有真正的友誼和愛情，感受到了自己內心的空虛和傷痛。
這個故事告訴我們，無情固然能夠保護自己不受傷害，但同時也剝奪了生活中的溫暖和情感，讓人內心空虛。因此，我們應該懂得保護自己，但也要學會對生活中的美好和情感敞開心扉。""",
  ),

  // ### 2. 莊子心性
  PopImage(
    540,
    115,
    190,
    80,
    'reference/2-1.jpg',
    '莊子心性 - 入故無情',
    '吾所謂無情者，言人之不以好惡內傷其身',
    """從前有一個叫做柳飛的年輕人，他常常以無情自居，認為感情只會帶來煩惱。有一天，村子裡來了一位神秘的賣藝人，他能預測人們的命運。當他遇見柳飛時，神色凝重地對他說：「你的心中充滿了冷漠，但這無情的心終究會成為你最深的傷痕。」柳飛聽了不以為然，覺得自己堅強無比。然而，時間流逝，他漸漸發現自己孤獨而空虛，沒有真正的友誼和愛情，感受到了自己內心的空虛和傷痛。
這個故事告訴我們，無情固然能夠保護自己不受傷害，但同時也剝奪了生活中的溫暖和情感，讓人內心空虛。因此，我們應該懂得保護自己，但也要學會對生活中的美好和情感敞開心扉。""",
  ),
  PopImage(
    540,
    200,
    190,
    185,
    'reference/2-2.jpg',
    '莊子心性 - 得斗升之水然活',
    '我，東海之波臣也。君豈有鬥升之水而活我哉?」周曰: 「諾。我將南遊吳越之王,激西 江之水而迎子,可乎?」'
        '鮒魚忿然作色曰:「吾失我常與，我所處。吾得鬥升之水然活耳，君乃言此，曾不如早索我於枯魚之肆!」。',
    """我是東海的一條鮒魚。你豈可靠著鬥升之水來生活我？周答道：「好，我將前往南方拜見吳越之王，引西江之水來迎接你，可以嗎？」鮒魚生氣地說：「我失去了我的常居之所，我所處的地方。我只是靠著鬥升之水才能生存，你卻說這樣的話，寧願早點在市場上尋找我。」這個故事告訴我們應該尊重自然，不要隨意干擾生物的生存環境，與自然和諧相處，這樣才能得到自然的保護與回報。""",
  ),
  PopImage(
    540,
    390,
    190,
    115,
    'reference/2-3.jpg',
    '莊子心性 - 生而曳尾于塗中',
    '吾聞楚有神龜，死已三千歲矣，王巾笥而藏之廟堂之上。此龜者，寧其死為留骨而貴乎?寧其生而曳尾于塗中乎?',
    """楚國有一隻神龜，已經死去三千年了，它的龜骨被裝在王巾和筐子裡，放在廟堂之上供人們膜拜。對這隻龜來說，是死後讓骨骸留在廟堂受人供奉貴重呢？還是活著時在泥土中自由自在地生活更為珍貴呢？這個故事告訴我們，生命的自由和尊嚴比任何財富和權力都更為珍貴，我們應該尊重每一個生命的存在，並為保護自然生態盡一份力量。""",
  ),
  PopImage(
    745,
    115,
    190,
    130,
    'reference/2-4.png',
    '莊子心性 - 物化',
    '莊周夢為蝴蝶，栩栩然蝴蝶也，自喻適志與，不知周也。俄然覺，則蘧蘧然周也。不知周之夢為蝴蝶與，蝴蝶之夢為周與?周與蝴蝶則必有分矣。此之謂物化。',
    """莊周夢見自己變成了一隻蝴蝶，栩栩然蝴蝶飛舞，他以為自己是真的成了蝴蝶，沒有意識到自己是莊周。突然間醒來，卻發現自己還是莊周。他不知道自己是莊周夢見成了蝴蝶，還是蝴蝶夢見成了莊周。如果莊周和蝴蝶互相夢見對方，那麼必然存在著物質和精神的分離。這就是所謂的物化。這個故事告訴我們，人生充滿了無法預測的變化，我們應該學會接受和享受每一個當下，不要過於固執於現實與夢境的區別，而是要珍惜眼前的一切。""",
  ),
  PopImage(
    745,
    250,
    190,
    90,
    'reference/2-5.jpeg',
    '莊子心性 - 生死為四時行',
    '人且偃然寢於巨室，而我噭噭 然隨而哭之，自以為不通乎命，故止也',
    """有一位年輕人叫做李青。有天在他閉上眼睛準備入睡的時候，突然聽見了一陣噭噭的聲音。李青睜開眼睛，發現自己的床邊站著一隻小鳥，牠正用哀婉的聲音啼哭著。李青感到十分奇怪，不明白這隻小鳥為什麼會在這裡哭泣。他起身打開窗戶，想讓小鳥飛出去，但小鳥卻仍然站在床邊不肯離去，繼續哭泣。李青靜靜地觀察著小鳥，突然間明白了其中的意義。他意識到自己與這隻小鳥之間有著一種特殊的共鳴，他們都在表達著內心的哀愁和不安。於是，李青停下了原本準備入睡的打算，靜靜地坐在床邊，陪伴著小鳥，共同面對著生命中的困惑和不安。
這個故事告訴我們，有時候，我們會因為生命中的困惑和不安而感到悲傷，但只要找到一個能夠共鳴的人或事物，我們就能夠找到力量和安慰，共同度過困難的時刻。""",
  ),
  PopImage(
    745,
    343,
    190,
    100,
    'reference/2-6.jpg',
    '莊子心性 - 以天地為棺槨',
    '吾以天地為棺槨，以日月為連璧，星辰為珠璣，萬物為齎送。',
    """一位年邁的老人對生死有深刻的思考。有一天，他對村裡的人們說：「當我離世時，請不要為我悲傷，因為我將以天地為我的棺槨，以日月為我的墓碑，星辰為我的寶珠，萬物為我的送給。」村裡的人們聽了都感到驚訝，他們不明白老人的話是什麼意思。但老人卻微笑著對他們說：「我將用我的一生來證明這一切的意義。」多年後，老人離世了，他的墓地被建在一個高山之上，四面環山，景色宏偉壯觀。墓地的碑文上刻著老人的遺言：“以天地為棺槨，以日月為連璧，星辰為珠璣，萬物為齎送。”人們經過這座墓地時，都會停下來感悟生命的脆弱和偉大。他們明白了老人的遺言，感受到生命的無盡價值。
這個故事告訴我們，生命的價值在於生生不息的循環，我們應該珍惜每一個生命，感恩萬物。""",
  ),

  // ### 3. 孔老之辯
  PopImage(
    1440,
    140,
    400,
    44,
    'reference/3-1.jpg',
    '孔老之辯 - 忘物忘天忘己',
    '有治在人,忘乎物,忘乎天;其名為忘己,忘己之人,是謂入於天。',
    """有一位名叫劉德的官員，他治理國家時非常智慧、寬厚。有人來訴苦求助時，他都會全心全意地幫助，不計較個人得失。
有一天，國家遭遇了嚴重的災害，許多村莊被洪水淹沒，百姓們無家可歸。劉德得知消息後，立即率領官員們前往災區救援，他們不辭辛勞地將受災的人們安置到安全的地方。
在災後重建的過程中，劉德沒有為自己爭取功勞，也沒有為自己索取一分利益，而是全心全意地為人民服務，忘我地投入到工作中。他的治理之道深得人民的愛戴，被譽為「忘己之人」。
劉德的故事告訴我們，在治理國家或處理事物時，應該忘記個人私利，忘記物質慾望，真正地關懷民眾，這樣才能成為真正融入天地之中的人。""",
  ),
  PopImage(
    1440,
    187,
    400,
    80,
    'reference/3-2.jpg',
    '孔老之辯 - 放德而行',
    '天地固有常矣，日月固有明矣，星辰固有列矣，禽獸固有群矣，樹木固有立矣。夫子亦放德而行，遁遁而趨，已至矣;',
    """有一位智者被村民們尊稱為老夫子。老夫子對人世間的繁華冷眼旁觀，他深知天地間的規律，明白萬物生命的本質。
有一天，他決定隱居於深山之中。放下了所有的名利與物質，追求心靈的自由與寧靜。在山中的日子裡，老夫子與自然相伴，靜心感悟天地之道，漸漸放下了對世俗的執著，明白了一切生命皆有其固有的歸宿與規律。
村民們常常前來拜訪老夫子，但他已隱居深山，不為外界所擾。然而，每當有人在山中迷路或遇到困難，老夫子總會伸出援手，給予他們智慧與指引。這個遠行生活成為了後人傳頌的美談，人們認為他真正融入了天地之中，得到了心靈的寧靜與安頓。這個故事告訴我們，人生無常，追求心靈的自由與寧靜，才能真正融入天地之中，得到內心的平靜與安頓。""",
  ),
  PopImage(
    1440,
    270,
    400,
    60,
    'reference/3-3.jpg',
    '孔老之辯 - 逍遙苟簡不貸',
    '怨、恩、取、與、諫、教、生、殺八者，正之器也，唯循大變無所湮者為能用之。',
    """有一位名叫葉清的賢臣被國王任命為宰相，負責治理國家的大政方針。 有一天，國王面臨一個重大的決策而猶豫不決。葉清知道國王的猶豫，便上前諫言道：“國王啊，治理國家就像航行在大海上一樣，需要隨時根據風浪的變化調整航向，不能被一時的困難所迷惑。”
國王聽了葉清的話，心中茅塞頓開，決心根據大道的變化來處理國家的事務。於是，他開始以更加寬厚的心胸對待怨恨，以更加慈悲的心態回報恩惠，以更加公正的標準分配資源，以更加明智的智慧來教導百姓。這個故事告訴我們，在治理事務時，必須遵循大道的變化，善用各種手段，才能夠事半功倍，達到事半功倍的效果。""",
  ),
  PopImage(
    1440,
    332,
    400,
    60,
    'reference/3-4.jpg',
    '孔老之辯 - 三皇五帝之辯',
    '丘得之矣。烏鵲孺，魚傅沫，細要者化，有弟而兄啼。久矣，夫丘不與化為人!不與化為人，安能化人。',
    """丘（指自己）已經得到了。烏鵲的幼鳥受到教導，魚的卵受到營養，經過繁琐的培育，有弟弟而兄長在哭泣。很久以來，丘自己沒有成為人，如果自己不成為人，又怎麼能夠教化他人呢？這個故事告訴我們，要想教化他人，首先要成為一個值得尊敬的人，只有以身作則，才能影響他人，改變他人的命運。""",
  ),
  PopImage(
    1440,
    395,
    400,
    50,
    'reference/3-5.jpg',
    '孔老之辯 - 六經之辯',
    '性不可易，命不可變，時不可止，道不可壅',
    """有一位名叫李青的青年，他性格豁達、善良，被村民們視為楷模。有一天，村莊遭遇了一場嚴重的水災，許多人的房屋被淹沒，生活受到了極大的影響。李青得知消息後，毅然決定幫助受災的村民，他組織了一支志願者隊伍，穿梭在水災中，救援受困的村民，安置無家可歸的人們。
雖然面對著艱難重重的困境，李青堅定地堅持著，沒有放棄對村民們的幫助。最終，隨著水災逐漸消退，村民們的生活逐漸恢復了正常，他們感激地望著李青，心中充滿了感激和敬佩。
故事道出了「性不可易，命不可變，時不可止，道不可壅」的道理。李青以自己的善良性格和堅定的信念，克服了困難，成為了村莊中的光輝楷模，同時也呼應了人性與命運的不易轉變，時間的不可逆轉，以及正道不可被阻擋的道理""",
  ),
  PopImage(
    1440,
    448,
    400,
    55,
    'reference/3-6.jpg',
    '孔老之辯 - 至美至樂',
    '丘之於道也，其猶醯雞與!微夫子之發吾覆也，吾不知天地之大全也。',
    """有一位名叫李青的青年，他性格豁達、善良，被村民們視為楷模。有一天，村莊遭遇了一場嚴重的水災，許多人的房屋被淹沒，生活受到了極大的影響。李青得知消息後，毅然決定幫助受災的村民，他組織了一支志願者隊伍，穿梭在水災中，救援受困的村民，安置無家可歸的人們。
雖然面對著艱難重重的困境，李青堅定地堅持著，沒有放棄對村民們的幫助。最終，隨著水災逐漸消退，村民們的生活逐漸恢復了正常，他們感激地望著李青，心中充滿了感激和敬佩。
故事道出了「性不可易，命不可變，時不可止，道不可壅」的道理。李青以自己的善良性格和堅定的信念，克服了困難，成為了村莊中的光輝楷模，同時也呼應了人性與命運的不易轉變，時間的不可逆轉，以及正道不可被阻擋的道理""",
  ),

  // ### 4. 遊心
  PopImage(
    990,
    600,
    400,
    70,
    'reference/4-1.jpg',
    '遊心 - 齊物我',
    '請循其本。子曰『汝安知魚樂』云者，既已知吾知之而問我。我知之濠上也。',
    """有一位年輕人叫王明。有一天，他遇見了一位智者，便上前請教：“智者啊，你能告訴我，魚是如何感受快樂的嗎？”
智者微笑著回答：“你怎麼知道魚的快樂？”
王明一時無言以對，隨後想明白了智者的意思。他明白到智者說的並不是要問他是否知道魚的快樂，而是在提醒他，有些事情即使知道了，也可能無法真正體會。
從此，王明放下了心中的困惑，努力去感受生命中的美好，並尊重每一種生命的存在。他明白到了人與自然之間的連結，以及謙卑地對待生命的重要性。""",
  ),
  PopImage(
    990,
    675,
    400,
    135,
    'reference/4-2.jpg',
    '遊心 - 齊譽非',
    '以指喻指之非指，不若以非指喻指之非指也;以馬喻馬之非馬，不若以非馬喻馬之非馬也。天地一指也，萬物一馬也.河伯始旋其面目，望洋向若而歎曰:“'
        '野語有之曰:‘聞道百，以為莫己若’者。我之謂也。且夫我嘗聞少仲尼之聞而輕伯夷之義者，始吾弗信;今我睹子之難窮也。',
    """在大河之邊，有一位河神河伯，他時常觀察著河流中的萬物，思考著萬物的奧妙。
有一天，河伯旋轉著自己的面目，望著遼闊的河流，心中感慨萬千，他嘆道：“野語中有一句話說：『聞聞道理雖多，卻認為沒有人能及得上自己。』這正是我此刻的心境。以前，我曾聽聞過孔子的聞名，卻對伯夷的高尚道德不以為然，覺得他的義行過於理想化。但現在我親眼目睹了你所面臨的困境，我才深刻地理解到了伯夷所堅守的真理。”
河伯深刻地體會到了孔子和伯夷的教義，他意識到了真理的深奧和生命的價值。從此以後，他更加珍惜每一個生命的存在，並且努力尋求著人生的真諦。
這個故事告訴我們，有時候我們需要從不同的角度去理解事物，才能夠更深刻地領悟到其中的真理和意義。""",
  ),
  PopImage(
    990,
    815,
    400,
    105,
    'reference/4-3.jpg',
    '遊心 - 齊禍福',
    '今子有大樹，患其無用，何不樹之於無何有之鄉，廣莫之野，彷徨乎無為其側，逍遙乎寢臥其下。不夭斤斧，物無害者，無所可 用，安所困苦哉!悶然而後應，泛然若辭',
    """山谷中有一顆巨大古樹，它的樹冠高聳入雲，樹幹粗壯如柱。這棵樹被人們稱為「自由樹」。
有一天，一位智者來到這片山谷，他望著自由樹，心生疑惑，便問道：“這棵樹何必在此處生長？它既無用，為何不將其種植在無人之境、廣袤的荒野之中呢？在那裡，它可以自由自在地生長，不受任何砍伐，不再有所困苦。”
聽了智者的問題，自由樹靜靜地回答道：“智者啊，你所說的無用，卻是我們生命的自由。在這片山谷中，我們雖然無法為人類帶來實際的利益，但我們的存在卻是為了自己的生存與繁衍。而如果被種植在荒野之中，雖然我們可以自由生長，但也許會面臨更多的危險與困苦。我們願意在這裡，享受自己的生命，即使是沒有用處的。”
智者聽後，深深地感悟到了自由樹的話語。他明白了自由與無為的真諦，並且尊重了自由樹所代表的生命價值。""",
  ),
  PopImage(
    990,
    925,
    400,
    70,
    'reference/4-4.jpg',
    '遊心 - 齊生死',
    '向吾入而吊焉，有老者哭之，如哭其子;少者哭之，如哭其母。彼其所以會之，必有不蘄言而言，不蘄哭而哭者。',
    """山谷中有一顆巨大古樹，它的樹冠高聳入雲，樹幹粗壯如柱。這棵樹被人們稱為「自由樹」。
有一天，一位智者來到這片山谷，他望著自由樹，心生疑惑，便問道：“這棵樹何必在此處生長？它既無用，為何不將其種植在無人之境、廣袤的荒野之中呢？在那裡，它可以自由自在地生長，不受任何砍伐，不再有所困苦。”
聽了智者的問題，自由樹靜靜地回答道：“智者啊，你所說的無用，卻是我們生命的自由。在這片山谷中，我們雖然無法為人類帶來實際的利益，但我們的存在卻是為了自己的生存與繁衍。而如果被種植在荒野之中，雖然我們可以自由生長，但也許會面臨更多的危險與困苦。我們願意在這裡，享受自己的生命，即使是沒有用處的。”
智者聽後，深深地感悟到了自由樹的話語。他明白了自由與無為的真諦，並且尊重了自由樹所代表的生命價值。""",
  ),

  // ### 5. 無名
  PopImage(
    540,
    625,
    400,
    108,
    'reference/5-1.jpeg',
    '無名 - 為善無近名',
    '吾生也有涯，而知也無涯。以有涯隨無涯，殆已;已而為知者，殆而已矣。為善無近名，為惡無近刑。緣督以為經，可以保身，可以全生，可以養親，可以盡年',
    """有一位名叫陳子的智者坐在自己的書房裡，思考著生命的意義。
突然間，一個年輕人來拜訪陳子，他問道：“陳老師，您認為人生的意義是什麼呢？”
陳子微笑著回答道：“人生的意義在於追求知識和智慧。但是，人的生命是有限的，而知識卻是無限的。我們無法在有限的生命中掌握無限的知識，這是一個殆已的事實。”
年輕人聽後沉思片刻，說道：“那麼，追求知識真的有意義嗎？”
陳子解釋道：“即使我們無法掌握所有的知識，但追求知識能夠使我們的生活更加豐富，更加有意義。通過學習，我們可以保護自己，照顧家人，延續生命。而且，追求知識也是為了不斷提升自己，讓自己成為更好的人。”
年輕人聽後點點頭，心生感慨。他明白了追求知識的重要性，也決心努力學習，為自己的生活增添更多的意義和價值。""",
  ),
  PopImage(
    540,
    740,
    400,
    68,
    'reference/5-2.jpeg',
    '無名 - 為混沌開七竅',
    '人皆有七竅以視聽食息，此獨無有，嘗試鑿之。',
    """有一位名叫劉安的探險家對自然界充滿好奇心。有一天，劉安在山谷裡發現了一個奇怪的生物，它身體呈現出人類的形狀，但卻沒有任何的竅道。
劉安感到十分驚訝，他想到了人類的七個感官，認為這個生物缺少竅道將無法感知世界，於是決定給它開鑿竅道，讓它也能像人類一樣視聽食息。
於是，劉安開始嘗試給這個生物開鑿竅道，但無論如何努力都無法成功。最終，他明白了這個生物的存在方式是與眾不同的，它不需要七竅來感知世界，因為它已經擁有了其他的方式來感知生活。
劉安深深地反思了自己的行為，他意識到了人類對於自然的干預可能是多餘的，我們應該尊重每一個生物的存在方式，而不是試圖改變它們。
這個故事告訴我們，人類應該尊重自然，不要過分干預和改變自然界，因為每一個生物都有自己獨特的存在方式，我們應該珍惜和尊重這種多樣性。""",
  ),
  PopImage(
    540,
    810,
    400,
    68,
    'reference/5-3.jpeg',
    '無名 - 殉利殉名殉家殉天下',
    '天下盡殉也:彼其所殉仁義也，則俗謂之君子;其所殉貨財也，則俗謂之小人。',
    """有一位名叫劉安的探險家對自然界充滿好奇心。有一天，劉安在山谷裡發現了一個奇怪的生物，它身體呈現出人類的形狀，但卻沒有任何的竅道。
劉安感到十分驚訝，他想到了人類的七個感官，認為這個生物缺少竅道將無法感知世界，於是決定給它開鑿竅道，讓它也能像人類一樣視聽食息。
於是，劉安開始嘗試給這個生物開鑿竅道，但無論如何努力都無法成功。最終，他明白了這個生物的存在方式是與眾不同的，它不需要七竅來感知世界，因為它已經擁有了其他的方式來感知生活。
劉安深深地反思了自己的行為，他意識到了人類對於自然的干預可能是多餘的，我們應該尊重每一個生物的存在方式，而不是試圖改變它們。
這個故事告訴我們，人類應該尊重自然，不要過分干預和改變自然界，因為每一個生物都有自己獨特的存在方式，我們應該珍惜和尊重這種多樣性。""",
  ),
  PopImage(
    540,
    880,
    400,
    90,
    'reference/5-4.jpeg',
    '無名 - 忠未必信孝未必愛',
    '外物不可必，故龍逢誅，比干戮，箕子狂，惡來死，桀紂亡。人主莫不欲其臣之忠，而忠未必信。人親莫不欲其子之孝，而孝未必愛，故孝己憂而曾參悲。',
    """有一位年輕人叫做劉志，來自一個普通的家庭，但卻有著崇高的志向和高尚的品德。他立志成為一名忠誠的臣子，為國家效力，為人民服務。
一天，國王發布了一道命令，要求所有的臣子們出征征戰。劉志毫不猶豫地響應了國王的號召，立即加入了軍隊，勇敢地赴戰。
在戰場上，劉志展現了出色的戰鬥技巧和領導能力，贏得了眾人的讚揚和尊敬。但是，就在戰鬥即將結束的時候，他不幸被敵人所傷，壯烈犧牲。
劉志的死讓國王和人民深感痛惜和哀悼，他們感激他為國家所做出的貢獻，並將他視為忠誠的楷模。
這個故事告訴我們，即使是普通人，只要心存忠誠和正義，也能成為人們心中的英雄。忠誠和孝順是受人們尊敬的美德。""",
  ),

  // ### 6. 無功
  PopImage(
    1440,
    600,
    400,
    110,
    'reference/6-1.jpg',
    '無功 - 無欲而天下足',
    '順物自然而無容私者，則天下治矣! 君子不得已而蒞臨天下，莫若無為。既以與人，己愈有。',
    """有一位賢明的國王，名叫王雄。他統治下的國家風調雨順，人民安居樂業。
有一天，王雄覺得自己的統治方式或許還有改進的空間，於是他召集了一群賢士進行討論。賢士們各自提出了自己的意見，有人建議加強國防，有人主張擴大經濟，但王雄卻沒有給出明確的指示。
最後，有一位老者站出來說道：“大王，我認為治理天下最重要的是順應自然、無私奉獻。只要大王能夠尊重自然的規律，不執著於個人私利，則天下就能夠得到治理。”
聽完老者的話，王雄恍然大悟，他意識到了無為而治的重要性。從此以後，他放下了執著，開始遵循自然的規律，以一種寬容、包容的心態來面對天下百姓，最終實現了天下太平的理想。""",
  ),
  PopImage(
    1440,
    715,
    400,
    145,
    'reference/6-2.jpg',
    '無功 - 無為而萬物化',
    '聞在宥天下，不聞治天下也。在之也者，恐天下之淫 其性也;宥之也者，恐天下之遷其德也。天下不淫其性，不遷其德，有治天下者哉!'
        '聞在宥天下，不聞治天下也。在之也者，恐天下之淫其性也;宥之也者，恐天下之遷其德也。',
    """有一位名叫劉禹的賢明君王，他以其睿智和慈悲而聞名於世。有一天，一群臣子向劉禹進言，建議他加強統治力度，以更有效地治理國家。
然而，劉禹卻沉思片刻後說道：“我們不應該追求統治的權力，而是要專注於維持人民的本性和道德。如果我們專注於統治，可能會激起人民的反抗，導致天下淫蕩其性；而如果我們放任不管，則可能會讓人民的道德逐漸衰退。真正的治世者應該致力於維護人民的本性不淫蕩，保持人民的道德不動搖。”
劉禹的智慧和慈悲感動了所有的臣民，他們深深地明白了真正的治世之道，並紛紛向劉禹效忠。
這個故事告訴我們，真正的治世者不是專注於追求權力和統治，而是致力於維護人民的本性和道德。""",
  ),
  PopImage(
    1440,
    865,
    400,
    40,
    'reference/6-3.jpg',
    '無功 - 淵靜而百姓定',
    '鄰國相望，雞犬之聲相聞，民至老死不相往來',
    """雖然鄰國相隔不遠，但因為長期的戰爭或不和而導致民眾彼此之間幾乎沒有交流。儘管鄰國相望，雞犬的聲音能夠彼此聽到，但民眾卻因為種種原因而無法互相往來，甚至是到老死都沒有見過對方。
這段文字反映了兩個鄰國之間的敵對關係，導致了彼此之間的隔閡和交流的中斷。這種情況可能是由於長期的仇恨、戰爭、文化差異或政治問題所致。
在故事中，這樣的情況可能導致了兩個鄰國之間的疏離和對立，進一步加劇了兩國之間的敵意和不信任，甚至可能引發更多的衝突和戰爭。""",
  ),
  PopImage(
    1440,
    915,
    400,
    80,
    'reference/6-4.jpg',
    '無功 - 外化而內不化',
    '子之愛親，命也。臣之事君，義也。',
    """有一位名叫李平的年輕人，從小就受到父母的慈愛與教育。李平對父母的愛戀之情由衷，無私地孝順照顧他們，盡心盡力地履行著作為兒子的義務。
後來，李平被國王招募入宮為官，成為一名忠心耿耿的臣子。他竭盡全力，忠心耿耿地為國效力，不計得失地履行著作為臣子的義務，將國家利益置於首位。
李平的行為感動了國王和人民，他被譽為忠臣節義的典範。
這個故事告訴我們，對於父母的愛是天生的，是作為人的基本情感之一；而對於國家和君主的忠誠則是建立在道德義務之上，是作為一個成熟社會成員的責任。只有同時尊重家庭和社會的價值，才能實現個人和社會的和諧發展。""",
  ),

  // ### 7. 大美不言
  PopImage(
    1885,
    325,
    355,
    80,
    'reference/7-1.png',
    '大美不言 - 天地有大美而不言',
    '吾唯不知務而輕用吾身，吾是以亡足。今吾來也，猶有尊足者存，吾是以務全之也。夫天無不覆，地無不載，吾以夫子為天地，安知夫子之猶若是也!',
    """""",
  ),
  PopImage(
    1885,
    410,
    355,
    80,
    'reference/7-2.jpeg',
    '大美不言 - 大言不辯',
    '夫大道不稱，大辯不言，大仁不仁，大廉不謙，大勇不忮。道昭而不道，言辯而不及，仁常而不成，廉清而不信，勇忮而不成。五者無棄而幾向方矣。',
    """""",
  ),
  PopImage(
    1885,
    495,
    355,
    55,
    'reference/7-3.jpeg',
    '大美不言 - 大同無已',
    '大人之教,若形之於影,聲之於響.有問而應之,盡其所懷,為開下配.處乎無響,行乎無方。',
    """""",
  ),
  PopImage(
    1885,
    555,
    355,
    60,
    'reference/7-4.jpeg',
    '大美不言 - 黑鳥白鳥',
    '夫鵠不日浴而白，烏不日黔而黑。黑白之樸，不足以為辯;名譽之觀，不足以為廣。',
    """""",
  ),
  PopImage(
    1885,
    620,
    355,
    70,
    'reference/7-5.jpeg',
    '大美不言 - 治之過也',
    '燒之剔之，刻之雒之，連之以羈馽，編之以皁棧，馬之死者十二三矣;飢之渴之，馳之驟之，整之齊之，前有橛飾之患，而後有鞭筴之威，而馬之死者已過半矣。',
    """""",
  ),
  PopImage(
    1885,
    700,
    355,
    100,
    'reference/7-6.jpeg',
    '大美不言 - 道何在',
    '世俗之所謂知者，有不為大盜積者乎?所謂聖者，有不為大盜守者乎?盜亦有道?何適而無有道邪?夫妄意室中之藏，聖也。入先，勇也。出後，義也。知可否，知也。分均，仁也。',
    """""",
  ),

  // ### 8. 棄聖止之
  PopImage(
    1885,
    970,
    355,
    80,
    'reference/8-1.jpeg',
    '棄聖止之 - 棄聖智天下平',
    '故絕聖棄智，大盜乃止;擿玉毁珠，小盗不起;焚符破璽，而民樸鄙;掊斗折衡，而民不爭，殚残天下之聖 法，而民始可與論議。',
    """""",
  ),
  PopImage(
    1885,
    1055,
    355,
    80,
    'reference/8-2.jpeg',
    '棄聖止之 - 使天下忘我難',
    '以敬孝易，以愛孝難;以愛孝易，以忘親難;忘親易，使親忘我難;使親忘我易，兼忘天下難;兼忘天下易，使天下兼忘我難。',
    """""",
  ),
  PopImage(
    1885,
    1140,
    355,
    50,
    'reference/8-3.jpeg',
    '棄聖止之 - 井底蛙',
    '井蛙不可以語於海者，拘於虛也;夏蟲不可以語於冰 者，篤於時也;曲士不可以語於道者，束於教也',
    """""",
  ),
  PopImage(
    1885,
    1195,
    355,
    60,
    'reference/8-4.jpeg',
    '棄聖止之 - 知所為',
    '以養其知之所不知，終其天年而不中道夭者，是知之盛也。',
    """""",
  ),
  PopImage(
    1885,
    1260,
    355,
    38,
    'reference/8-5.jpeg',
    '棄聖止之 - 知所損',
    '夢飲酒者，旦而哭泣;夢哭泣者，旦而田獵。',
    """""",
  ),
  PopImage(
    1885,
    1300,
    355,
    60,
    'reference/8-6.jpeg',
    '棄聖止之 - 知無用',
    '知無用而始可與言用矣，夫地非不廣且大也，然則無用之為用也亦明矣。',
    """""",
  ),

  // ### 9. 心齋坐忘
  PopImage(
    600,
    1130,
    230,
    140,
    'reference/9-1.jpg',
    '心齋坐忘 - 心智專一用心不用耳',
    '庖丁為文惠君解牛，手之所觸，肩之所倚，足之所履，膝之所踦，砉然嚮然，奏刀騞然，莫不中音。合於桑林之舞，乃中經首之會。',
    """""",
  ),
  PopImage(
    600,
    1275,
    230,
    100,
    'reference/9-2.jpg',
    '心齋坐忘 - 空明容物用氣不用心',
    '五六月累垸二而不墜，則失者錙 銖;累三而不墜，則失者十一; 累五而不墜，猶掇之也。',
    """""",
  ),
  PopImage(
    600,
    1395,
    230,
    100,
    'reference/9-3.jpg',
    '心齋坐忘 - 人間世',
    '汝不知夫螳螂乎?怒其臂以當車轍，不知其不勝任也，是其才之美者也。戒之，慎之，積伐而美者以犯之，幾矣!',
    """""",
  ),
  PopImage(
    840,
    1130,
    250,
    60,
    'reference/9-4.jpg',
    '心齋坐忘 - 顔回坐忘',
    '墮肢體，黜聰明，離形去知，同於大通，此謂坐忘。',
    """""",
  ),
  PopImage(
    840,
    1195,
    250,
    110,
    'reference/9-5.jpg',
    '心齋坐忘 - 忘欲忘知',
    '文王觀於臧，見一丈夫釣，而其釣莫釣。非持其釣有釣者也，常釣也。',
    """""",
  ),
  PopImage(
    840,
    1320,
    250,
    90,
    'reference/9-6.jpg',
    '心齋坐忘 - 忘己忘治',
    '幾矣，雞雖有鳴者，已無變矣，望之似木雞矣，其德全矣。異雞無敢應者，反走矣。',
    """""",
  ),

  // ### 10. 六步六境
  PopImage(
    1240,
    1130,
    280,
    75,
    'reference/10-1.jpg',
    '六步六境 - 適性不忘本',
    '澤雉十步一啄，百步一飲，不蘄畜乎樊中。神雖王，不善也。',
    """""",
  ),
  PopImage(
    1240,
    1210,
    280,
    130,
    'reference/10-2.jpg',
    '六步六境 - 喜怒不入心',
    '夫忿滀之氣，散而不反，則為不足;上而不下，則使人善怒;下而不上，則使人善忘;不上不下，中身當心，則為病。',
    """""",
  ),
  PopImage(
    1240,
    1345,
    280,
    90,
    'reference/10-3.jpg',
    '六步六境 - 萬物一体侍',
    '至人之用心若鏡，不將不迎，應而不藏，故能勝物而不傷。',
    """""",
  ),
  PopImage(
    1525,
    1130,
    280,
    110,
    'reference/10-4.jpg',
    '六步六境 - 死生不為擾',
    '死，無君於上，無臣於下;亦無四時之事，從然以天地為春秋，雖南面王樂，不能過也。',
    """""",
  ),
  PopImage(
    1525,
    1245,
    280,
    130,
    'reference/10-5.jpg',
    '六步六境 - 禍福不足憂',
    '白刃交於前，視死若生者，烈士之勇也;知窮之有命，知通之有時，臨大難而不懼者，聖人之勇也。',
    """""",
  ),
  PopImage(
    1525,
    1380,
    280,
    85,
    'reference/10-6.jpg',
    '六步六境 - 逍遙自由身',
    '此龜者，寧其死為留骨而貴乎?寧 其生而曳尾於塗中乎?',
    """""",
  ),

  // ### 11. 無為守本
  PopImage(
    140,
    410,
    340,
    60,
    'reference/11-1.jpg',
    '無為守本 - 不要不自量力',
    '汝不知夫螳螂乎?怒其臂以當車轍，不知其不勝任 也，是其才之美者也。',
    """""",
  ),
  PopImage(
    140,
    475,
    340,
    70,
    'reference/11-2.jpg',
    '無為守本 - 不要違本性',
    '汝不知夫養虎者乎?不敢以生物與之，為其殺之之怒 也;不敢以全物與之，為其決之之怒也;時其飢飽，達其怒心。',
    """""",
  ),
  PopImage(
    140,
    550,
    340,
    70,
    'reference/11-3.jpeg',
    '無為守本 - 不要溺愛',
    '夫愛馬者以筐盛矢，以蜄盛溺，適有蚊虻僕緣，而拊之不時，則缺銜毀首碎胸。意有所至，而愛有所亡，可不慎耶?',
    """""",
  ),
  PopImage(
    140,
    625,
    340,
    80,
    'reference/11-4.jpeg',
    '無為守本 - 無功不受祿',
    '知足者，不以利自累也。廢上，非義也;殺民，非仁也;人犯其難，我享 其利，非謙也。',
    """""",
  ),
  PopImage(
    140,
    710,
    340,
    42,
    'reference/11-5.jpeg',
    '無為守本 - 聖人亡人國而不失人心',
    '聖人之用兵也，亡國而不失人心。',
    """""",
  ),
  PopImage(
    140,
    755,
    340,
    70,
    'reference/11-6.jpeg',
    '無為守本 - 聖人觀予天下而不助',
    '故聖人觀於天而不助，成於德而不累，出於道而不謀，會於仁而不恃，薄於義而不積，應於禮而不諱，接於事而不辭，齊於法而不亂，恃於民而不輕，因於物而不去。',
    """""",
  ),

  // ### 12. 三劍四患
  PopImage(
    140,
    1000,
    340,
    210,
    'reference/12-1.jpeg',
    '三劍四患 - 三劍三戰',
    '天子劍,直之無前，舉之無上，案之無下，運之無旁，上決浮雲，下絕地紀。此劍一用，匡諸侯，天下服矣。'
        '諸侯劍，直之亦無前，舉之亦無上，案之亦無下，運之亦無旁;上法圓天以順三光，下法方地以順四時，中和 民意以安四鄉。此劍一用，如雷霆之震也，四封之內，無不賓服而聽從君命者矣。'
        '庶人劍，蓬頭突鬢垂冠，曼胡之纓，短後之衣，瞋目而 語難。相擊於前，上斬頸領，下決肝肺。此庶人之劍， 無異於鬥雞，一旦命已絕矣，無所用於國事。',
    """""",
  ),
  PopImage(
    140,
    1213,
    340,
    83,
    'reference/12-2.jpeg',
    '三劍四患 - 識人九要',
    '遠使之而觀其忠，近使之而觀其敬，煩使之而觀其能，卒然問焉而觀其知，急與之期而觀其信，委之以財而觀其仁，告之以危而觀其節，醉之以酒而觀其側，雜之以處而觀其色。',
    """""",
  ),
  PopImage(
    140,
    1300,
    340,
    90,
    'reference/12-3.jpeg',
    '三劍四患 - 八病',
    '非其事而事之，謂之摠;莫之顧而進之，謂之佞;希意 道言，謂之諂;不擇是非而言，謂之諛;好言人之惡，謂之讒;'
        '析交離親，謂之賊;稱譽詐偽以敗惡人，謂之 慝;不擇善否，兩容頰適，偷拔其所欲，謂之險。',
    """""",
  ),
  PopImage(
    140,
    1393,
    340,
    75,
    'reference/12-4.jpeg',
    '三劍四患 - 四患',
    '好經大事，變更易常，以掛功名，謂之叨;專知擅事，侵人自用，謂之貪;見過不更，聞諫愈甚，謂之很; 人同於己則可，不同於己，雖善不善，謂之矜。',
    """""",
  ),
];

/* 參考標題
1. 消遙遊子
1.1 逍遙似巨棚展翅天際
1.2 逍遙似列子御風而行
1.3 逍遙似姑射山神人游乎四海
1.4 逍遙似許由不受天下

2. 莊子心性
2.1 入故無情
2.2 得斗升之水然活
2.3 生而曳尾于塗中
2.4 物化
2.5 生死為四時行
2.6 以天地為棺槨

3. 孔老之辯
3.1 忘物忘天忘己
3.2 放德而行
3.3 逍遙苟簡不貸
3.4 三皇五帝之辯
3.5 六經之辯
3.6 至美至樂

4. 遊心
4.1 齊物我
4.2 齊譽非
4.3 齊禍福
4.4 齊生死

5. 無名
5.1 為善無近名
5.2 為混沌開七竅
5.3 殉利殉名殉家殉天下
5.4 忠未必信孝未必愛

6. 無功
6.1 無欲而天下足
6.2 無為而萬物化
6.3 淵靜而百姓定
6.4 外化而內不化

7. 大美不言
7.1 天地有大美而不言
7.2 大言不辯
7.3 大同無已
7.4 黑鳥白鳥
7.5 治之過也
7.6 道何在

8. 棄聖止之
8.1 棄聖智天下平
8.2 使天下忘我難
8.3 井底蛙
8.4 知所為
8.5 知所損
8.6 知無用

9. 心齋坐忘
9.1 心智專一用心不用耳
9.2 空明容物用氣不用心
9.3 人間世
9.4 顔回坐忘
9.5 忘欲忘知
9.6 忘己忘治

10. 六步六境
10.1 適性不忘本
10.2 喜怒不入心
10.3 萬物一体侍
10.4 死生不為擾
10.5 禍福不足憂
10.6 逍遙自由身
10.7 朝彻見獨

11. 無為守本
11.1 不要不自量力
11.2 不要違本性
11.3 不要溺愛
11.4 無功不受祿
11.5 聖人亡人國而不失人心
11.6 聖人觀予天下而不助

12. 三劍四患
12.1 三劍三戰
12.2 識人九要
12.3 八病
12.4 四患
*/
