import 'object.dart';

double factor = 0.3;
String tabName = '莊子通覽圖';
List<PopImage> popImages = [
  // ### 1. 逍遙遊子
  PopImage('逍遙遊子 - 鯤與鵬', 'reference/1-1.jpeg', 980, 150, 210, 100),
  PopImage('逍遙遊子 - 列子1.2', 'reference/1-2.jpeg', 980, 255, 210, 80),
  PopImage('逍遙遊子 - 山人', 'reference/1-3.jpg', 980, 340, 210, 130),
  PopImage('逍遙遊子 - 山人', 'reference/1-3.jpg', 1200, 150, 200, 45),
  PopImage('逍遙遊子 - 列子1.4', 'reference/1-4.jpeg', 1200, 198, 200, 135),

  // ### 2. 莊子心性
  PopImage('莊子心性 - 人本無情', 'reference/2-1.jpg', 540, 115, 190, 80),
  PopImage('莊子心性 - 借貸', 'reference/2-2.jpg', 540, 200, 190, 185),
  PopImage('莊子心性 - 不為官', 'reference/2-3.jpg', 540, 390, 190, 115),
  PopImage('莊子心性 - 莊周夢蝶', 'reference/2-4.png', 745, 115, 190, 130),
  PopImage('莊子心性 - 生死四時', 'reference/2-5.jpeg', 745, 250, 190, 90),
  PopImage('莊子心性 - 天地為棺', 'reference/2-6.jpg', 745, 343, 190, 100),

  // ### 3. 孔老之辯
  PopImage('孔老之辯 - 忘物忘天忘己', 'reference/3-1.jpg', 1440, 140, 400, 44),
  PopImage('孔老之辯 - 放德而行', 'reference/3-2.jpg', 1440, 187, 400, 80),
  PopImage('孔老之辯 - 逍遙苟簡不貸', 'reference/3-3.jpg', 1440, 270, 400, 60),
  PopImage('孔老之辯 - 三皇五帝之辯', 'reference/3-4.jpg', 1440, 332, 400, 60),
  PopImage('孔老之辯 - 六經之辯', 'reference/3-5.jpg', 1440, 395, 400, 50),
  PopImage('孔老之辯 - 至美至樂', 'reference/3-6.jpg', 1440, 448, 400, 55),

  // ### 7. 大美不言
  PopImage('邯鄲學步', 'reference/7-1.png', 1880, 330, 360, 80),

  // ### 8. 棄聖止之
  PopImage('井底之蛙', 'reference/8-3.jpeg', 1880, 1050, 360, 80),
];

/* 參考標題
1. 消遙遊子
1.1 逍遙似巨棚展翅天際
1.2 逍遙似列子御風而行
1.3 逍遙似姑射山神人游乎四海
1.4 逍遙似許由不受天下

2. 莊子心性
2.1 入故無情
2.2 得斗升之水然活
2.3 生而曳尾于塗中
2.4 物化
2.5 生死為四時行
2.6 以天地為棺槨

3. 孔老之辯
3.1 忘物忘天忘己
3.2 放德而行
3.3 逍遙苟簡不貸
3.4 三皇五帝之辯
3.5 六經之辯
3.6 至美至樂

4. 遊心
4.1 齊物我
4.2 齊譽非
4.3 齊禍福
4.4 齊生死

5. 無名
5.1 為善無近名
5.2 為混沌開七竅
5.3 殉利殉名殉家殉天下
5.4 忠未必信孝未必愛

6. 無功
6.1 無欲而天下足
6.2 無為而萬物化
6.3 淵靜而百姓定
6.4 外化而內不化

7. 大美不言
7.1 天地有大美而不言
7.2 大言不辯
7.3 大同無已
7.4 黑鳥白鳥
7.5 治之過也
7.6 道何在

8. 棄聖止之
8.1 棄聖智天下平
8.2 使天下忘我難
8.3 井底蛙
8.4 知所為
8.5 知所損
8.6 知無用

9. 心齋坐忘
9.1 心智專一用心不用耳
9.2 空明容物用氣不用心
9.3 人間世
9.4 顔回坐忘
9.5 忘欲忘知
9.6 忘己忘治

10. 六步六境
10.1 適性不忘本
10.2 喜怒不入心
10.3 萬物一体侍
10.4 死生不為擾
10.5 禍福不足憂
10.6 逍遙自由身
10.7 朝彻見獨

11. 無為守本
11.1 不要不自量力
11.2 不要違本性
11.3 不要溺愛
11.4 無功不受祿
11.5 聖人亡人國而不失人心
11.6 聖人觀予天下而不助

12. 三劍四患
12.1 三劍三戰
12.2 識人九要
12.3 八病
12.4 四患
*/
