import 'object.dart';

double factor = 0.3;
String tabName = '莊子通覽圖';
List<PopImage> popImages = [
  // ### 1. 逍遙遊子
  PopImage(
    980,
    150,
    210,
    100,
    'reference/1-1.jpeg',
    '逍遙遊子 - 逍遙似巨棚展翅天際',
    '北海有大魚名鯤，乘六月大風，奮力一躍為巨鵬，擊水汗順風而行九萬里，背風，奔于風之止',
  ),
  PopImage(
    980,
    255,
    210,
    80,
    'reference/1-2.jpeg',
    '逍遙遊子 - 逍遙似列子御風而行',
    '列子乘天地之延御風而行冷然善也以遊無窮，句有五日而後返',
  ),
  PopImage(
    980,
    340,
    210,
    130,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
  ),
  PopImage(
    1200,
    150,
    200,
    45,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
  ),
  PopImage(
    1200,
    198,
    200,
    135,
    'reference/1-4.jpeg',
    '逍遙遊子 - 逍遙似許由不受天下',
    '堯欲讓天下于許由。許由說：「天下在你治理下以安定了，我來代替你是位著名嗎?」小鳥築巢所需不過一支，晏鼠飲水所需不過滿腹。我要天下做什麼?',
  ),

  // ### 2. 莊子心性
  PopImage(
    540,
    115,
    190,
    80,
    'reference/2-1.jpg',
    '莊子心性 - 入故無情',
    '吾所謂無情者，言人之不以好惡內傷其身',
  ),
  PopImage(
    540,
    200,
    190,
    185,
    'reference/2-2.jpg',
    '莊子心性 - 得斗升之水然活',
    '我，東海之波臣也。君豈有鬥升之水而活我哉?」周曰: 「諾。我將南遊吳越之王,激西 江之水而迎子,可乎?」'
        '鮒魚忿然作色曰:「吾失我常與，我所處。吾得鬥升之水然活耳，君乃言此，曾不如早索我於枯魚之肆!」。',
  ),
  PopImage(
    540,
    390,
    190,
    115,
    'reference/2-3.jpg',
    '莊子心性 - 生而曳尾于塗中',
    '吾聞楚有神龜，死已三千歲矣，王巾笥而藏之廟堂之上。此龜者，寧其死為留骨而貴乎?寧其生而曳尾于塗中乎?',
  ),
  PopImage(
    745,
    115,
    190,
    130,
    'reference/2-4.png',
    '莊子心性 - 物化',
    '莊周夢為蝴蝶，栩栩然蝴蝶也，自喻適志與，不知周也。俄然覺，則蘧蘧然周也。不知周之夢為蝴蝶與，蝴蝶之夢為周與?周與蝴蝶則必有分矣。此之謂物化。',
  ),
  PopImage(
    745,
    250,
    190,
    90,
    'reference/2-5.jpeg',
    '莊子心性 - 生死為四時行',
    '人且偃然寢於巨室，而我噭噭 然隨而哭之，自以為不通乎命，故止也',
  ),
  PopImage(
    745,
    343,
    190,
    100,
    'reference/2-6.jpg',
    '莊子心性 - 以天地為棺槨',
    '吾以天地為棺槨，以日月為連璧，星辰為珠璣，萬物為齎送。',
  ),

  // ### 3. 孔老之辯
  PopImage(
    1440,
    140,
    400,
    44,
    'reference/3-1.jpg',
    '孔老之辯 - 忘物忘天忘己',
    '有治在人,忘乎物,忘乎天;其名為忘己,忘己之人,是謂入於天。',
  ),
  PopImage(
    1440,
    187,
    400,
    80,
    'reference/3-2.jpg',
    '孔老之辯 - 放德而行',
    '天地固有常矣，日月固有明矣，星辰固有列矣，禽獸固有群矣，樹木固有立矣。夫子亦放德而行，遁遁而趨，已至矣;',
  ),
  PopImage(
    1440,
    270,
    400,
    60,
    'reference/3-3.jpg',
    '孔老之辯 - 逍遙苟簡不貸',
    '怨、恩、取、與、諫、教、生、殺八者，正之器也，唯循大變無所湮者為能用之。',
  ),
  PopImage(
    1440,
    332,
    400,
    60,
    'reference/3-4.jpg',
    '孔老之辯 - 三皇五帝之辯',
    '丘得之矣。烏鵲孺，魚傅沫，細要者化，有弟而兄啼。久矣，夫丘不與化為人!不與化為人，安能化人。',
  ),
  PopImage(
    1440,
    395,
    400,
    50,
    'reference/3-5.jpg',
    '孔老之辯 - 六經之辯',
    '性不可易，命不可變，時不可止，道不可壅',
  ),
  PopImage(
    1440,
    448,
    400,
    55,
    'reference/3-6.jpg',
    '孔老之辯 - 至美至樂',
    '丘之於道也，其猶醯雞與!微夫子之發吾覆也，吾不知天地之大全也。',
  ),

  // ### 4. 遊心
  PopImage(
    990,
    600,
    400,
    70,
    'reference/4-1.jpg',
    '遊心 - 齊物我',
    '請循其本。子曰『汝安知魚樂』云者，既已知吾知之而問我。我知之濠上也。',
  ),
  PopImage(
    990,
    675,
    400,
    135,
    'reference/4-2.jpg',
    '遊心 - 齊譽非',
    '以指喻指之非指，不若以非指喻指之非指也;以馬喻馬之非馬，不若以非馬喻馬之非馬也。天地一指也，萬物一馬也.河伯始旋其面目，望洋向若而歎曰:“'
        '野語有之曰:‘聞道百，以為莫己若’者。我之謂也。且夫我嘗聞少仲尼之聞而輕伯夷之義者，始吾弗信;今我睹子之難窮也。',
  ),
  PopImage(
    990,
    815,
    400,
    105,
    'reference/4-3.jpg',
    '遊心 - 齊禍福',
    '今子有大樹，患其無用，何不樹之於無何有之鄉，廣莫之野，彷徨乎無為其側，逍遙乎寢臥其下。不夭斤斧，物無害者，無所可 用，安所困苦哉!悶然而後應，泛然若辭',
  ),
  PopImage(
    990,
    925,
    400,
    70,
    'reference/4-4.jpg',
    '遊心 - 齊生死',
    '向吾入而吊焉，有老者哭之，如哭其子;少者哭之，如哭其母。彼其所以會之，必有不蘄言而言，不蘄哭而哭者。',
  ),

  // ### 5. 無名
  PopImage(
    540,
    625,
    400,
    108,
    'reference/5-1.jpeg',
    '無名 - 為善無近名',
    '吾生也有涯，而知也無涯。以有涯隨無涯，殆已;已而為知者，殆而已矣。為善無近名，為惡無近刑。緣督以為經，可以保身，可以全生，可以養親，可以盡年',
  ),
  PopImage(
    540,
    740,
    400,
    68,
    'reference/5-2.jpeg',
    '無名 - 為混沌開七竅',
    '人皆有七竅以視聽食息，此獨無有，嘗試鑿之。',
  ),
  PopImage(
    540,
    810,
    400,
    68,
    'reference/5-3.jpeg',
    '無名 - 殉利殉名殉家殉天下',
    '天下盡殉也:彼其所殉仁義也，則俗謂之君子;其所殉貨財也，則俗謂之小人。',
  ),
  PopImage(
    540,
    880,
    400,
    90,
    'reference/5-4.jpeg',
    '無名 - 忠未必信孝未必愛',
    '外物不可必，故龍逢誅，比干戮，箕子狂，惡來死，桀紂亡。人主莫不欲其臣之忠，而忠未必信。人親莫不欲其子之孝，而孝未必愛，故孝己憂而曾參悲。',
  ),

  // ### 6. 無功
  PopImage(
    1440,
    600,
    400,
    110,
    'reference/6-1.jpg',
    '無功 - 無欲而天下足',
    '順物自然而無容私者，則天下治矣! 君子不得已而蒞臨天下，莫若無為。既以與人，己愈有。',
  ),
  PopImage(
    1440,
    715,
    400,
    145,
    'reference/6-2.jpg',
    '無功 - 無為而萬物化',
    '聞在宥天下，不聞治天下也。在之也者，恐天下之淫 其性也;宥之也者，恐天下之遷其德也。天下不淫其性，不遷其德，有治天下者哉!'
        '聞在宥天下，不聞治天下也。在之也者，恐天下之淫其性也;宥之也者，恐天下之遷其德也。',
  ),
  PopImage(
    1440,
    865,
    400,
    40,
    'reference/6-3.jpg',
    '無功 - 淵靜而百姓定',
    '鄰國相望，雞犬之聲相聞，民至老死不相往來',
  ),
  PopImage(
    1440,
    915,
    400,
    80,
    'reference/6-4.jpg',
    '無功 - 外化而內不化',
    '子之愛親，命也。臣之事君，義也。',
  ),

  // ### 7. 大美不言
  PopImage(
    1885,
    325,
    355,
    80,
    'reference/7-1.png',
    '大美不言 - 天地有大美而不言',
    '吾唯不知務而輕用吾身，吾是以亡足。今吾來也，猶有尊足者存，吾是以務全之也。夫天無不覆，地無不載，吾以夫子為天地，安知夫子之猶若是也!',
  ),
  PopImage(
    1885,
    410,
    355,
    80,
    'reference/7-2.jpeg',
    '大美不言 - 大言不辯',
    '夫大道不稱，大辯不言，大仁不仁，大廉不謙，大勇不忮。道昭而不道，言辯而不及，仁常而不成，廉清而不信，勇忮而不成。五者無棄而幾向方矣。',
  ),
  PopImage(
    1885,
    495,
    355,
    55,
    'reference/7-3.jpeg',
    '大美不言 - 大同無已',
    '大人之教,若形之於影,聲之於響.有問而應之,盡其所懷,為開下配.處乎無響,行乎無方。',
  ),
  PopImage(
    1885,
    555,
    355,
    60,
    'reference/7-4.jpeg',
    '大美不言 - 黑鳥白鳥',
    '夫鵠不日浴而白，烏不日黔而黑。黑白之樸，不足以為辯;名譽之觀，不足以為廣。',
  ),
  PopImage(
    1885,
    620,
    355,
    70,
    'reference/7-5.jpeg',
    '大美不言 - 治之過也',
    '燒之剔之，刻之雒之，連之以羈馽，編之以皁棧，馬之死者十二三矣;飢之渴之，馳之驟之，整之齊之，前有橛飾之患，而後有鞭筴之威，而馬之死者已過半矣。',
  ),
  PopImage(
    1885,
    700,
    355,
    100,
    'reference/7-6.jpeg',
    '大美不言 - 道何在',
    '世俗之所謂知者，有不為大盜積者乎?所謂聖者，有不為大盜守者乎?盜亦有道?何適而無有道邪?夫妄意室中之藏，聖也。入先，勇也。出後，義也。知可否，知也。分均，仁也。',
  ),

  // ### 8. 棄聖止之
  PopImage(
    1885,
    970,
    355,
    80,
    'reference/8-1.jpeg',
    '棄聖止之 - 棄聖智天下平',
    '故絕聖棄智，大盜乃止;擿玉毁珠，小盗不起;焚符破璽，而民樸鄙;掊斗折衡，而民不爭，殚残天下之聖 法，而民始可與論議。',
  ),
  PopImage(
    1885,
    1055,
    355,
    80,
    'reference/8-2.jpeg',
    '棄聖止之 - 使天下忘我難',
    '以敬孝易，以愛孝難;以愛孝易，以忘親難;忘親易，使親忘我難;使親忘我易，兼忘天下難;兼忘天下易，使天下兼忘我難。',
  ),
  PopImage(
    1885,
    1140,
    355,
    50,
    'reference/8-3.jpeg',
    '棄聖止之 - 井底蛙',
    '井蛙不可以語於海者，拘於虛也;夏蟲不可以語於冰 者，篤於時也;曲士不可以語於道者，束於教也',
  ),
  PopImage(
    1885,
    1195,
    355,
    60,
    'reference/8-4.jpeg',
    '棄聖止之 - 知所為',
    '以養其知之所不知，終其天年而不中道夭者，是知之盛也。',
  ),
  PopImage(
    1885,
    1260,
    355,
    38,
    'reference/8-5.jpeg',
    '棄聖止之 - 知所損',
    '夢飲酒者，旦而哭泣;夢哭泣者，旦而田獵。',
  ),
  PopImage(
    1885,
    1300,
    355,
    60,
    'reference/8-6.jpeg',
    '棄聖止之 - 知無用',
    '知無用而始可與言用矣，夫地非不廣且大也，然則無用之為用也亦明矣。',
  ),

  // ### 9. 心齋坐忘
  PopImage(
    600,
    1130,
    230,
    140,
    'reference/9-1.jpg',
    '心齋坐忘 - 心智專一用心不用耳',
    '庖丁為文惠君解牛，手之所觸，肩之所倚，足之所履，膝之所踦，砉然嚮然，奏刀騞然，莫不中音。合於桑林之舞，乃中經首之會。',
  ),
  PopImage(
    600,
    1275,
    230,
    100,
    'reference/9-2.jpg',
    '心齋坐忘 - 空明容物用氣不用心',
    '五六月累垸二而不墜，則失者錙 銖;累三而不墜，則失者十一; 累五而不墜，猶掇之也。',
  ),
  PopImage(
    600,
    1395,
    230,
    100,
    'reference/9-3.jpg',
    '心齋坐忘 - 人間世',
    '汝不知夫螳螂乎?怒其臂以當車轍，不知其不勝任也，是其才之美者也。戒之，慎之，積伐而美者以犯之，幾矣!',
  ),
  PopImage(
    840,
    1130,
    250,
    60,
    'reference/9-4.jpg',
    '心齋坐忘 - 顔回坐忘',
    '墮肢體，黜聰明，離形去知，同於大通，此謂坐忘。',
  ),
  PopImage(
    840,
    1195,
    250,
    110,
    'reference/9-5.jpg',
    '心齋坐忘 - 忘欲忘知',
    '文王觀於臧，見一丈夫釣，而其釣莫釣。非持其釣有釣者也，常釣也。',
  ),
  PopImage(
    840,
    1320,
    250,
    90,
    'reference/9-6.jpg',
    '心齋坐忘 - 忘己忘治',
    '幾矣，雞雖有鳴者，已無變矣，望之似木雞矣，其德全矣。異雞無敢應者，反走矣。',
  ),

  // ### 10. 六步六境
  PopImage(
    1240,
    1130,
    280,
    75,
    'reference/10-1.jpg',
    '六步六境 - 適性不忘本',
    '澤雉十步一啄，百步一飲，不蘄畜乎樊中。神雖王，不善也。',
  ),
  PopImage(
    1240,
    1210,
    280,
    130,
    'reference/10-2.jpg',
    '六步六境 - 喜怒不入心',
    '夫忿滀之氣，散而不反，則為不足;上而不下，則使人善怒;下而不上，則使人善忘;不上不下，中身當心，則為病。',
  ),
  PopImage(
    1240,
    1345,
    280,
    90,
    'reference/10-3.jpg',
    '六步六境 - 萬物一体侍',
    '至人之用心若鏡，不將不迎，應而不藏，故能勝物而不傷。',
  ),
  PopImage(
    1525,
    1130,
    280,
    110,
    'reference/10-4.jpg',
    '六步六境 - 死生不為擾',
    '死，無君於上，無臣於下;亦無四時之事，從然以天地為春秋，雖南面王樂，不能過也。',
  ),
  PopImage(
    1525,
    1245,
    280,
    130,
    'reference/10-5.jpg',
    '六步六境 - 禍福不足憂',
    '白刃交於前，視死若生者，烈士之勇也;知窮之有命，知通之有時，臨大難而不懼者，聖人之勇也。',
  ),
  PopImage(
    1525,
    1380,
    280,
    85,
    'reference/10-6.jpg',
    '六步六境 - 逍遙自由身',
    '此龜者，寧其死為留骨而貴乎?寧 其生而曳尾於塗中乎?',
  ),

  // ### 11. 無為守本
  PopImage(
    140,
    410,
    340,
    60,
    'reference/11-1.jpg',
    '無為守本 - 不要不自量力',
    '汝不知夫螳螂乎?怒其臂以當車轍，不知其不勝任 也，是其才之美者也。',
  ),
  PopImage(
    140,
    475,
    340,
    70,
    'reference/11-2.jpg',
    '無為守本 - 不要違本性',
    '汝不知夫養虎者乎?不敢以生物與之，為其殺之之怒 也;不敢以全物與之，為其決之之怒也;時其飢飽，達其怒心。',
  ),
  PopImage(
    140,
    550,
    340,
    70,
    'reference/11-3.jpeg',
    '無為守本 - 不要溺愛',
    '夫愛馬者以筐盛矢，以蜄盛溺，適有蚊虻僕緣，而拊之不時，則缺銜毀首碎胸。意有所至，而愛有所亡，可不慎耶?',
  ),
  PopImage(
    140,
    625,
    340,
    80,
    'reference/11-4.jpeg',
    '無為守本 - 無功不受祿',
    '知足者，不以利自累也。廢上，非義也;殺民，非仁也;人犯其難，我享 其利，非謙也。',
  ),
  PopImage(
    140,
    710,
    340,
    42,
    'reference/11-5.jpeg',
    '無為守本 - 聖人亡人國而不失人心',
    '聖人之用兵也，亡國而不失人心。',
  ),
  PopImage(
    140,
    755,
    340,
    70,
    'reference/11-6.jpeg',
    '無為守本 - 聖人觀予天下而不助',
    '故聖人觀於天而不助，成於德而不累，出於道而不謀，會於仁而不恃，薄於義而不積，應於禮而不諱，接於事而不辭，齊於法而不亂，恃於民而不輕，因於物而不去。',
  ),

  // ### 12. 三劍四患
  PopImage(
    140,
    1000,
    340,
    210,
    'reference/12-1.jpeg',
    '三劍四患 - 三劍三戰',
    '天子劍,直之無前，舉之無上，案之無下，運之無旁，上決浮雲，下絕地紀。此劍一用，匡諸侯，天下服矣。'
        '諸侯劍，直之亦無前，舉之亦無上，案之亦無下，運之亦無旁;上法圓天以順三光，下法方地以順四時，中和 民意以安四鄉。此劍一用，如雷霆之震也，四封之內，無不賓服而聽從君命者矣。'
        '庶人劍，蓬頭突鬢垂冠，曼胡之纓，短後之衣，瞋目而 語難。相擊於前，上斬頸領，下決肝肺。此庶人之劍， 無異於鬥雞，一旦命已絕矣，無所用於國事。',
  ),
  PopImage(
    140,
    1213,
    340,
    83,
    'reference/12-2.jpeg',
    '三劍四患 - 識人九要',
    '遠使之而觀其忠，近使之而觀其敬，煩使之而觀其能，卒然問焉而觀其知，急與之期而觀其信，委之以財而觀其仁，告之以危而觀其節，醉之以酒而觀其側，雜之以處而觀其色。',
  ),
  PopImage(
    140,
    1300,
    340,
    90,
    'reference/12-3.jpeg',
    '三劍四患 - 八病',
    '非其事而事之，謂之摠;莫之顧而進之，謂之佞;希意 道言，謂之諂;不擇是非而言，謂之諛;好言人之惡，謂之讒;'
        '析交離親，謂之賊;稱譽詐偽以敗惡人，謂之 慝;不擇善否，兩容頰適，偷拔其所欲，謂之險。',
  ),
  PopImage(
    140,
    1393,
    340,
    75,
    'reference/12-4.jpeg',
    '三劍四患 - 四患',
    '好經大事，變更易常，以掛功名，謂之叨;專知擅事，侵人自用，謂之貪;見過不更，聞諫愈甚，謂之很; 人同於己則可，不同於己，雖善不善，謂之矜。',
  ),
];

/* 參考標題
1. 消遙遊子
1.1 逍遙似巨棚展翅天際
1.2 逍遙似列子御風而行
1.3 逍遙似姑射山神人游乎四海
1.4 逍遙似許由不受天下

2. 莊子心性
2.1 入故無情
2.2 得斗升之水然活
2.3 生而曳尾于塗中
2.4 物化
2.5 生死為四時行
2.6 以天地為棺槨

3. 孔老之辯
3.1 忘物忘天忘己
3.2 放德而行
3.3 逍遙苟簡不貸
3.4 三皇五帝之辯
3.5 六經之辯
3.6 至美至樂

4. 遊心
4.1 齊物我
4.2 齊譽非
4.3 齊禍福
4.4 齊生死

5. 無名
5.1 為善無近名
5.2 為混沌開七竅
5.3 殉利殉名殉家殉天下
5.4 忠未必信孝未必愛

6. 無功
6.1 無欲而天下足
6.2 無為而萬物化
6.3 淵靜而百姓定
6.4 外化而內不化

7. 大美不言
7.1 天地有大美而不言
7.2 大言不辯
7.3 大同無已
7.4 黑鳥白鳥
7.5 治之過也
7.6 道何在

8. 棄聖止之
8.1 棄聖智天下平
8.2 使天下忘我難
8.3 井底蛙
8.4 知所為
8.5 知所損
8.6 知無用

9. 心齋坐忘
9.1 心智專一用心不用耳
9.2 空明容物用氣不用心
9.3 人間世
9.4 顔回坐忘
9.5 忘欲忘知
9.6 忘己忘治

10. 六步六境
10.1 適性不忘本
10.2 喜怒不入心
10.3 萬物一体侍
10.4 死生不為擾
10.5 禍福不足憂
10.6 逍遙自由身
10.7 朝彻見獨

11. 無為守本
11.1 不要不自量力
11.2 不要違本性
11.3 不要溺愛
11.4 無功不受祿
11.5 聖人亡人國而不失人心
11.6 聖人觀予天下而不助

12. 三劍四患
12.1 三劍三戰
12.2 識人九要
12.3 八病
12.4 四患
*/
