import 'object.dart';

double factor = 0.3;
String tabName = '莊子通覽圖';
List<PopImage> popImages = [
  // ### 1. 逍遙遊子
  PopImage(
    980,
    150,
    210,
    100,
    'reference/1-1.jpeg',
    '逍遙遊子 - 逍遙似巨棚展翅天際',
    '北海有大魚名鯤，乘六月大風，奮力一躍為巨鵬，擊水汗順風而行九萬里，背風，奔于風之止',
    """在北海深處，有一條名叫鯤的大魚，身形巨大，成群結隊在海底遨游。每當到了六月，北海上空總是刮著強勁的大風，掀起了巨浪，讓海洋煥發出壯闊的氣勢。
而這時的鯤魚，卻是其最為活躍的時候。它們會趁著這股大風，奮力一躍，化作了一隻巨大的鵬鳥，展翅飛翔於天際。在這風起雲湧的六月之夜，它們帶著驚人的力量，翱翔九萬里遠，穿越過山川大河，越過了無盡的大海，直至風之止。
像鯤魚在逆境中一樣，我們可以發揮出驚人的力量和能力。只要努力奮鬥，克服困難，就能夠戰勝逆風，達到遠大的目標。""",
  ),
  PopImage(
    980,
    255,
    210,
    80,
    'reference/1-2.jpeg',
    '逍遙遊子 - 逍遙似列子御風而行',
    '列子乘天地之延御風而行冷然善也以遊無窮，句有五日而後返',
    """一位名叫列子的智者，他對於天地的運行和自然的法則有著非凡的洞察力。有一天，他帶著一顆平靜的心，乘著天地的延續力，御風而行，展開了一場奇妙的冒險之旅。
列子身著一袭淡青色的衣袍，面無表情，如同一塊冰雪，與風優雅地舞動。他隨著風的方向，穿越著山川河流，穿梭在雲霧之間，體驗著自然界的奇妙之處。
他看到了大地的壯麗景色，感受到了風的呼嘯聲，領略了水的柔情。在這無窮無盡的空間中，他感受到了生命的美好和宇宙的神奇。
經過五天的旅行，列子終於返回了原來的地方。雖然旅途艱辛，但他心中充滿了對於自然的敬畏和對於生命的感悟。
如果我們能夠保持一顆平靜的心，順應自然的力量，就能夠征服困難，達到目的地。""",
  ),
  PopImage(
    980,
    340,
    210,
    130,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
    """在藐姑射山的深處有一位仙人，人們稱他為藐姑射神人。他的身形優雅，肌膚如同冰雪一般晶瑩剔透，綽約婀娜如同處子。他不參食五穀，而是靠吸收風和露水來維持生命。
這位神人擁有著非凡的力量和神通，他可以乘著雲氣飛行，御使飛龍，遊歷於天地間的奇幻之境。他穿梭於山川之間，飛越大海，探尋著世界的奧秘。
人們對於藐姑射神人的故事充滿了神秘和崇敬，他被視為是仙界的使者，代表著祥和與美好。""",
  ),
  PopImage(
    1200,
    150,
    200,
    45,
    'reference/1-3.jpg',
    '逍遙遊子 - 逍遙似姑射山神人游乎四海',
    '藐姑射之山有神人居焉，肌膚若冰雪，綽約若處子，不食五穀，吸風飲露，乘雲氣，御飛龍，而遊乎四海之外。與萬物合為一體，不勞形傷神管事間俗事',
    """從前，堯帝欲將天下轉交給許由，但許由心存疑慮。他問：“天下在你治理下已經安定，那我來接替你又有何名分呢？”堯帝聽後，並不生氣，而是微笑著回答道：“小鳥築巢所需不過一枝，晏鼠飲水所需不過滿腹。我要你做的就是這樣簡單。” 於是，許由心懷感激，接受了堯帝的重托，繼續為國家和人民奉獻自己的力量。
這個故事表達了一種謙虛和知足的態度，即使承擔的責任看似簡單，但其重要性卻不容忽視。""",
  ),
  PopImage(
    1200,
    198,
    200,
    135,
    'reference/1-4.jpeg',
    '逍遙遊子 - 逍遙似許由不受天下',
    '堯欲讓天下于許由。許由說：「天下在你治理下以安定了，我來代替你是位著名嗎?」小鳥築巢所需不過一支，晏鼠飲水所需不過滿腹。我要天下做什麼?',
    """從前有一個叫做柳飛的年輕人，他常常以無情自居，認為感情只會帶來煩惱。有一天，村子裡來了一位神秘的賣藝人，他能預測人們的命運。當他遇見柳飛時，神色凝重地對他說：「你的心中充滿了冷漠，但這無情的心終究會成為你最深的傷痕。」柳飛聽了不以為然，覺得自己堅強無比。然而，時間流逝，他漸漸發現自己孤獨而空虛，沒有真正的友誼和愛情，感受到了自己內心的空虛和傷痛。
這個故事告訴我們，無情固然能夠保護自己不受傷害，但同時也剝奪了生活中的溫暖和情感，讓人內心空虛。因此，我們應該懂得保護自己，但也要學會對生活中的美好和情感敞開心扉。""",
  ),

  // ### 2. 莊子心性
  PopImage(
    540,
    115,
    190,
    80,
    'reference/2-1.jpg',
    '莊子心性 - 入故無情',
    '吾所謂無情者，言人之不以好惡內傷其身',
    """從前有一個叫做柳飛的年輕人，他常常以無情自居，認為感情只會帶來煩惱。有一天，村子裡來了一位神秘的賣藝人，他能預測人們的命運。當他遇見柳飛時，神色凝重地對他說：「你的心中充滿了冷漠，但這無情的心終究會成為你最深的傷痕。」柳飛聽了不以為然，覺得自己堅強無比。然而，時間流逝，他漸漸發現自己孤獨而空虛，沒有真正的友誼和愛情，感受到了自己內心的空虛和傷痛。
這個故事告訴我們，無情固然能夠保護自己不受傷害，但同時也剝奪了生活中的溫暖和情感，讓人內心空虛。因此，我們應該懂得保護自己，但也要學會對生活中的美好和情感敞開心扉。""",
  ),
  PopImage(
    540,
    200,
    190,
    185,
    'reference/2-2.jpg',
    '莊子心性 - 得斗升之水然活',
    '我，東海之波臣也。君豈有鬥升之水而活我哉?」周曰: 「諾。我將南遊吳越之王,激西 江之水而迎子,可乎?」'
        '鮒魚忿然作色曰:「吾失我常與，我所處。吾得鬥升之水然活耳，君乃言此，曾不如早索我於枯魚之肆!」。',
    """我是東海的一條鮒魚。你豈可靠著鬥升之水來生活我？周答道：「好，我將前往南方拜見吳越之王，引西江之水來迎接你，可以嗎？」鮒魚生氣地說：「我失去了我的常居之所，我所處的地方。我只是靠著鬥升之水才能生存，你卻說這樣的話，寧願早點在市場上尋找我。」這個故事告訴我們應該尊重自然，不要隨意干擾生物的生存環境，與自然和諧相處，這樣才能得到自然的保護與回報。""",
  ),
  PopImage(
    540,
    390,
    190,
    115,
    'reference/2-3.jpg',
    '莊子心性 - 生而曳尾于塗中',
    '吾聞楚有神龜，死已三千歲矣，王巾笥而藏之廟堂之上。此龜者，寧其死為留骨而貴乎?寧其生而曳尾于塗中乎?',
    """楚國有一隻神龜，已經死去三千年了，它的龜骨被裝在王巾和筐子裡，放在廟堂之上供人們膜拜。對這隻龜來說，是死後讓骨骸留在廟堂受人供奉貴重呢？還是活著時在泥土中自由自在地生活更為珍貴呢？這個故事告訴我們，生命的自由和尊嚴比任何財富和權力都更為珍貴，我們應該尊重每一個生命的存在，並為保護自然生態盡一份力量。""",
  ),
  PopImage(
    745,
    115,
    190,
    130,
    'reference/2-4.png',
    '莊子心性 - 物化',
    '莊周夢為蝴蝶，栩栩然蝴蝶也，自喻適志與，不知周也。俄然覺，則蘧蘧然周也。不知周之夢為蝴蝶與，蝴蝶之夢為周與?周與蝴蝶則必有分矣。此之謂物化。',
    """莊周夢見自己變成了一隻蝴蝶，栩栩然蝴蝶飛舞，他以為自己是真的成了蝴蝶，沒有意識到自己是莊周。突然間醒來，卻發現自己還是莊周。他不知道自己是莊周夢見成了蝴蝶，還是蝴蝶夢見成了莊周。如果莊周和蝴蝶互相夢見對方，那麼必然存在著物質和精神的分離。這就是所謂的物化。這個故事告訴我們，人生充滿了無法預測的變化，我們應該學會接受和享受每一個當下，不要過於固執於現實與夢境的區別，而是要珍惜眼前的一切。""",
  ),
  PopImage(
    745,
    250,
    190,
    90,
    'reference/2-5.jpeg',
    '莊子心性 - 生死為四時行',
    '人且偃然寢於巨室，而我噭噭 然隨而哭之，自以為不通乎命，故止也',
    """有一位年輕人叫做李青。有天在他閉上眼睛準備入睡的時候，突然聽見了一陣噭噭的聲音。李青睜開眼睛，發現自己的床邊站著一隻小鳥，牠正用哀婉的聲音啼哭著。李青感到十分奇怪，不明白這隻小鳥為什麼會在這裡哭泣。他起身打開窗戶，想讓小鳥飛出去，但小鳥卻仍然站在床邊不肯離去，繼續哭泣。李青靜靜地觀察著小鳥，突然間明白了其中的意義。他意識到自己與這隻小鳥之間有著一種特殊的共鳴，他們都在表達著內心的哀愁和不安。於是，李青停下了原本準備入睡的打算，靜靜地坐在床邊，陪伴著小鳥，共同面對著生命中的困惑和不安。
這個故事告訴我們，有時候，我們會因為生命中的困惑和不安而感到悲傷，但只要找到一個能夠共鳴的人或事物，我們就能夠找到力量和安慰，共同度過困難的時刻。""",
  ),
  PopImage(
    745,
    343,
    190,
    100,
    'reference/2-6.jpg',
    '莊子心性 - 以天地為棺槨',
    '吾以天地為棺槨，以日月為連璧，星辰為珠璣，萬物為齎送。',
    """一位年邁的老人對生死有深刻的思考。有一天，他對村裡的人們說：「當我離世時，請不要為我悲傷，因為我將以天地為我的棺槨，以日月為我的墓碑，星辰為我的寶珠，萬物為我的送給。」村裡的人們聽了都感到驚訝，他們不明白老人的話是什麼意思。但老人卻微笑著對他們說：「我將用我的一生來證明這一切的意義。」多年後，老人離世了，他的墓地被建在一個高山之上，四面環山，景色宏偉壯觀。墓地的碑文上刻著老人的遺言：“以天地為棺槨，以日月為連璧，星辰為珠璣，萬物為齎送。”人們經過這座墓地時，都會停下來感悟生命的脆弱和偉大。他們明白了老人的遺言，感受到生命的無盡價值。
這個故事告訴我們，生命的價值在於生生不息的循環，我們應該珍惜每一個生命，感恩萬物。""",
  ),

  // ### 3. 孔老之辯
  PopImage(
    1440,
    140,
    400,
    44,
    'reference/3-1.jpg',
    '孔老之辯 - 忘物忘天忘己',
    '有治在人,忘乎物,忘乎天;其名為忘己,忘己之人,是謂入於天。',
    """有一位名叫劉德的官員，他治理國家時非常智慧、寬厚。有人來訴苦求助時，他都會全心全意地幫助，不計較個人得失。
有一天，國家遭遇了嚴重的災害，許多村莊被洪水淹沒，百姓們無家可歸。劉德得知消息後，立即率領官員們前往災區救援，他們不辭辛勞地將受災的人們安置到安全的地方。
在災後重建的過程中，劉德沒有為自己爭取功勞，也沒有為自己索取一分利益，而是全心全意地為人民服務，忘我地投入到工作中。他的治理之道深得人民的愛戴，被譽為「忘己之人」。
劉德的故事告訴我們，在治理國家或處理事物時，應該忘記個人私利，忘記物質慾望，真正地關懷民眾，這樣才能成為真正融入天地之中的人。""",
  ),
  PopImage(
    1440,
    187,
    400,
    80,
    'reference/3-2.jpg',
    '孔老之辯 - 放德而行',
    '天地固有常矣，日月固有明矣，星辰固有列矣，禽獸固有群矣，樹木固有立矣。夫子亦放德而行，遁遁而趨，已至矣;',
    """有一位智者被村民們尊稱為老夫子。老夫子對人世間的繁華冷眼旁觀，他深知天地間的規律，明白萬物生命的本質。
有一天，他決定隱居於深山之中。放下了所有的名利與物質，追求心靈的自由與寧靜。在山中的日子裡，老夫子與自然相伴，靜心感悟天地之道，漸漸放下了對世俗的執著，明白了一切生命皆有其固有的歸宿與規律。
村民們常常前來拜訪老夫子，但他已隱居深山，不為外界所擾。然而，每當有人在山中迷路或遇到困難，老夫子總會伸出援手，給予他們智慧與指引。這個遠行生活成為了後人傳頌的美談，人們認為他真正融入了天地之中，得到了心靈的寧靜與安頓。這個故事告訴我們，人生無常，追求心靈的自由與寧靜，才能真正融入天地之中，得到內心的平靜與安頓。""",
  ),
  PopImage(
    1440,
    270,
    400,
    60,
    'reference/3-3.jpg',
    '孔老之辯 - 逍遙苟簡不貸',
    '怨、恩、取、與、諫、教、生、殺八者，正之器也，唯循大變無所湮者為能用之。',
    """有一位名叫葉清的賢臣被國王任命為宰相，負責治理國家的大政方針。 有一天，國王面臨一個重大的決策而猶豫不決。葉清知道國王的猶豫，便上前諫言道：“國王啊，治理國家就像航行在大海上一樣，需要隨時根據風浪的變化調整航向，不能被一時的困難所迷惑。”
國王聽了葉清的話，心中茅塞頓開，決心根據大道的變化來處理國家的事務。於是，他開始以更加寬厚的心胸對待怨恨，以更加慈悲的心態回報恩惠，以更加公正的標準分配資源，以更加明智的智慧來教導百姓。這個故事告訴我們，在治理事務時，必須遵循大道的變化，善用各種手段，才能夠事半功倍，達到事半功倍的效果。""",
  ),
  PopImage(
    1440,
    332,
    400,
    60,
    'reference/3-4.jpg',
    '孔老之辯 - 三皇五帝之辯',
    '丘得之矣。烏鵲孺，魚傅沫，細要者化，有弟而兄啼。久矣，夫丘不與化為人!不與化為人，安能化人。',
    """丘（指自己）已經得到了。烏鵲的幼鳥受到教導，魚的卵受到營養，經過繁琐的培育，有弟弟而兄長在哭泣。很久以來，丘自己沒有成為人，如果自己不成為人，又怎麼能夠教化他人呢？這個故事告訴我們，要想教化他人，首先要成為一個值得尊敬的人，只有以身作則，才能影響他人，改變他人的命運。""",
  ),
  PopImage(
    1440,
    395,
    400,
    50,
    'reference/3-5.jpg',
    '孔老之辯 - 六經之辯',
    '性不可易，命不可變，時不可止，道不可壅',
    """有一位名叫李青的青年，他性格豁達、善良，被村民們視為楷模。有一天，村莊遭遇了一場嚴重的水災，許多人的房屋被淹沒，生活受到了極大的影響。李青得知消息後，毅然決定幫助受災的村民，他組織了一支志願者隊伍，穿梭在水災中，救援受困的村民，安置無家可歸的人們。
雖然面對著艱難重重的困境，李青堅定地堅持著，沒有放棄對村民們的幫助。最終，隨著水災逐漸消退，村民們的生活逐漸恢復了正常，他們感激地望著李青，心中充滿了感激和敬佩。
故事道出了「性不可易，命不可變，時不可止，道不可壅」的道理。李青以自己的善良性格和堅定的信念，克服了困難，成為了村莊中的光輝楷模，同時也呼應了人性與命運的不易轉變，時間的不可逆轉，以及正道不可被阻擋的道理""",
  ),
  PopImage(
    1440,
    448,
    400,
    55,
    'reference/3-6.jpg',
    '孔老之辯 - 至美至樂',
    '丘之於道也，其猶醯雞與!微夫子之發吾覆也，吾不知天地之大全也。',
    """有一位名叫李青的青年，他性格豁達、善良，被村民們視為楷模。有一天，村莊遭遇了一場嚴重的水災，許多人的房屋被淹沒，生活受到了極大的影響。李青得知消息後，毅然決定幫助受災的村民，他組織了一支志願者隊伍，穿梭在水災中，救援受困的村民，安置無家可歸的人們。
雖然面對著艱難重重的困境，李青堅定地堅持著，沒有放棄對村民們的幫助。最終，隨著水災逐漸消退，村民們的生活逐漸恢復了正常，他們感激地望著李青，心中充滿了感激和敬佩。
故事道出了「性不可易，命不可變，時不可止，道不可壅」的道理。李青以自己的善良性格和堅定的信念，克服了困難，成為了村莊中的光輝楷模，同時也呼應了人性與命運的不易轉變，時間的不可逆轉，以及正道不可被阻擋的道理""",
  ),

  // ### 4. 遊心
  PopImage(
    990,
    600,
    400,
    70,
    'reference/4-1.jpg',
    '遊心 - 齊物我',
    '請循其本。子曰『汝安知魚樂』云者，既已知吾知之而問我。我知之濠上也。',
    """有一位年輕人叫王明。有一天，他遇見了一位智者，便上前請教：“智者啊，你能告訴我，魚是如何感受快樂的嗎？”
智者微笑著回答：“你怎麼知道魚的快樂？”
王明一時無言以對，隨後想明白了智者的意思。他明白到智者說的並不是要問他是否知道魚的快樂，而是在提醒他，有些事情即使知道了，也可能無法真正體會。
從此，王明放下了心中的困惑，努力去感受生命中的美好，並尊重每一種生命的存在。他明白到了人與自然之間的連結，以及謙卑地對待生命的重要性。""",
  ),
  PopImage(
    990,
    675,
    400,
    135,
    'reference/4-2.jpg',
    '遊心 - 齊譽非',
    '以指喻指之非指，不若以非指喻指之非指也;以馬喻馬之非馬，不若以非馬喻馬之非馬也。天地一指也，萬物一馬也.河伯始旋其面目，望洋向若而歎曰:“'
        '野語有之曰:‘聞道百，以為莫己若’者。我之謂也。且夫我嘗聞少仲尼之聞而輕伯夷之義者，始吾弗信;今我睹子之難窮也。',
    """在大河之邊，有一位河神河伯，他時常觀察著河流中的萬物，思考著萬物的奧妙。
有一天，河伯旋轉著自己的面目，望著遼闊的河流，心中感慨萬千，他嘆道：“野語中有一句話說：『聞聞道理雖多，卻認為沒有人能及得上自己。』這正是我此刻的心境。以前，我曾聽聞過孔子的聞名，卻對伯夷的高尚道德不以為然，覺得他的義行過於理想化。但現在我親眼目睹了你所面臨的困境，我才深刻地理解到了伯夷所堅守的真理。”
河伯深刻地體會到了孔子和伯夷的教義，他意識到了真理的深奧和生命的價值。從此以後，他更加珍惜每一個生命的存在，並且努力尋求著人生的真諦。
這個故事告訴我們，有時候我們需要從不同的角度去理解事物，才能夠更深刻地領悟到其中的真理和意義。""",
  ),
  PopImage(
    990,
    815,
    400,
    105,
    'reference/4-3.jpg',
    '遊心 - 齊禍福',
    '今子有大樹，患其無用，何不樹之於無何有之鄉，廣莫之野，彷徨乎無為其側，逍遙乎寢臥其下。不夭斤斧，物無害者，無所可 用，安所困苦哉!悶然而後應，泛然若辭',
    """山谷中有一顆巨大古樹，它的樹冠高聳入雲，樹幹粗壯如柱。這棵樹被人們稱為「自由樹」。
有一天，一位智者來到這片山谷，他望著自由樹，心生疑惑，便問道：“這棵樹何必在此處生長？它既無用，為何不將其種植在無人之境、廣袤的荒野之中呢？在那裡，它可以自由自在地生長，不受任何砍伐，不再有所困苦。”
聽了智者的問題，自由樹靜靜地回答道：“智者啊，你所說的無用，卻是我們生命的自由。在這片山谷中，我們雖然無法為人類帶來實際的利益，但我們的存在卻是為了自己的生存與繁衍。而如果被種植在荒野之中，雖然我們可以自由生長，但也許會面臨更多的危險與困苦。我們願意在這裡，享受自己的生命，即使是沒有用處的。”
智者聽後，深深地感悟到了自由樹的話語。他明白了自由與無為的真諦，並且尊重了自由樹所代表的生命價值。""",
  ),
  PopImage(
    990,
    925,
    400,
    70,
    'reference/4-4.jpg',
    '遊心 - 齊生死',
    '向吾入而吊焉，有老者哭之，如哭其子;少者哭之，如哭其母。彼其所以會之，必有不蘄言而言，不蘄哭而哭者。',
    """山谷中有一顆巨大古樹，它的樹冠高聳入雲，樹幹粗壯如柱。這棵樹被人們稱為「自由樹」。
有一天，一位智者來到這片山谷，他望著自由樹，心生疑惑，便問道：“這棵樹何必在此處生長？它既無用，為何不將其種植在無人之境、廣袤的荒野之中呢？在那裡，它可以自由自在地生長，不受任何砍伐，不再有所困苦。”
聽了智者的問題，自由樹靜靜地回答道：“智者啊，你所說的無用，卻是我們生命的自由。在這片山谷中，我們雖然無法為人類帶來實際的利益，但我們的存在卻是為了自己的生存與繁衍。而如果被種植在荒野之中，雖然我們可以自由生長，但也許會面臨更多的危險與困苦。我們願意在這裡，享受自己的生命，即使是沒有用處的。”
智者聽後，深深地感悟到了自由樹的話語。他明白了自由與無為的真諦，並且尊重了自由樹所代表的生命價值。""",
  ),

  // ### 5. 無名
  PopImage(
    540,
    625,
    400,
    108,
    'reference/5-1.jpeg',
    '無名 - 為善無近名',
    '吾生也有涯，而知也無涯。以有涯隨無涯，殆已;已而為知者，殆而已矣。為善無近名，為惡無近刑。緣督以為經，可以保身，可以全生，可以養親，可以盡年',
    """有一位名叫陳子的智者坐在自己的書房裡，思考著生命的意義。
突然間，一個年輕人來拜訪陳子，他問道：“陳老師，您認為人生的意義是什麼呢？”
陳子微笑著回答道：“人生的意義在於追求知識和智慧。但是，人的生命是有限的，而知識卻是無限的。我們無法在有限的生命中掌握無限的知識，這是一個殆已的事實。”
年輕人聽後沉思片刻，說道：“那麼，追求知識真的有意義嗎？”
陳子解釋道：“即使我們無法掌握所有的知識，但追求知識能夠使我們的生活更加豐富，更加有意義。通過學習，我們可以保護自己，照顧家人，延續生命。而且，追求知識也是為了不斷提升自己，讓自己成為更好的人。”
年輕人聽後點點頭，心生感慨。他明白了追求知識的重要性，也決心努力學習，為自己的生活增添更多的意義和價值。""",
  ),
  PopImage(
    540,
    740,
    400,
    68,
    'reference/5-2.jpeg',
    '無名 - 為混沌開七竅',
    '人皆有七竅以視聽食息，此獨無有，嘗試鑿之。',
    """有一位名叫劉安的探險家對自然界充滿好奇心。有一天，劉安在山谷裡發現了一個奇怪的生物，它身體呈現出人類的形狀，但卻沒有任何的竅道。
劉安感到十分驚訝，他想到了人類的七個感官，認為這個生物缺少竅道將無法感知世界，於是決定給它開鑿竅道，讓它也能像人類一樣視聽食息。
於是，劉安開始嘗試給這個生物開鑿竅道，但無論如何努力都無法成功。最終，他明白了這個生物的存在方式是與眾不同的，它不需要七竅來感知世界，因為它已經擁有了其他的方式來感知生活。
劉安深深地反思了自己的行為，他意識到了人類對於自然的干預可能是多餘的，我們應該尊重每一個生物的存在方式，而不是試圖改變它們。
這個故事告訴我們，人類應該尊重自然，不要過分干預和改變自然界，因為每一個生物都有自己獨特的存在方式，我們應該珍惜和尊重這種多樣性。""",
  ),
  PopImage(
    540,
    810,
    400,
    68,
    'reference/5-3.jpeg',
    '無名 - 殉利殉名殉家殉天下',
    '天下盡殉也:彼其所殉仁義也，則俗謂之君子;其所殉貨財也，則俗謂之小人。',
    """有一位名叫劉安的探險家對自然界充滿好奇心。有一天，劉安在山谷裡發現了一個奇怪的生物，它身體呈現出人類的形狀，但卻沒有任何的竅道。
劉安感到十分驚訝，他想到了人類的七個感官，認為這個生物缺少竅道將無法感知世界，於是決定給它開鑿竅道，讓它也能像人類一樣視聽食息。
於是，劉安開始嘗試給這個生物開鑿竅道，但無論如何努力都無法成功。最終，他明白了這個生物的存在方式是與眾不同的，它不需要七竅來感知世界，因為它已經擁有了其他的方式來感知生活。
劉安深深地反思了自己的行為，他意識到了人類對於自然的干預可能是多餘的，我們應該尊重每一個生物的存在方式，而不是試圖改變它們。
這個故事告訴我們，人類應該尊重自然，不要過分干預和改變自然界，因為每一個生物都有自己獨特的存在方式，我們應該珍惜和尊重這種多樣性。""",
  ),
  PopImage(
    540,
    880,
    400,
    90,
    'reference/5-4.jpeg',
    '無名 - 忠未必信孝未必愛',
    '外物不可必，故龍逢誅，比干戮，箕子狂，惡來死，桀紂亡。人主莫不欲其臣之忠，而忠未必信。人親莫不欲其子之孝，而孝未必愛，故孝己憂而曾參悲。',
    """有一位年輕人叫做劉志，來自一個普通的家庭，但卻有著崇高的志向和高尚的品德。他立志成為一名忠誠的臣子，為國家效力，為人民服務。
一天，國王發布了一道命令，要求所有的臣子們出征征戰。劉志毫不猶豫地響應了國王的號召，立即加入了軍隊，勇敢地赴戰。
在戰場上，劉志展現了出色的戰鬥技巧和領導能力，贏得了眾人的讚揚和尊敬。但是，就在戰鬥即將結束的時候，他不幸被敵人所傷，壯烈犧牲。
劉志的死讓國王和人民深感痛惜和哀悼，他們感激他為國家所做出的貢獻，並將他視為忠誠的楷模。
這個故事告訴我們，即使是普通人，只要心存忠誠和正義，也能成為人們心中的英雄。忠誠和孝順是受人們尊敬的美德。""",
  ),

  // ### 6. 無功
  PopImage(
    1440,
    600,
    400,
    110,
    'reference/6-1.jpg',
    '無功 - 無欲而天下足',
    '順物自然而無容私者，則天下治矣! 君子不得已而蒞臨天下，莫若無為。既以與人，己愈有。',
    """有一位賢明的國王，名叫王雄。他統治下的國家風調雨順，人民安居樂業。
有一天，王雄覺得自己的統治方式或許還有改進的空間，於是他召集了一群賢士進行討論。賢士們各自提出了自己的意見，有人建議加強國防，有人主張擴大經濟，但王雄卻沒有給出明確的指示。
最後，有一位老者站出來說道：“大王，我認為治理天下最重要的是順應自然、無私奉獻。只要大王能夠尊重自然的規律，不執著於個人私利，則天下就能夠得到治理。”
聽完老者的話，王雄恍然大悟，他意識到了無為而治的重要性。從此以後，他放下了執著，開始遵循自然的規律，以一種寬容、包容的心態來面對天下百姓，最終實現了天下太平的理想。""",
  ),
  PopImage(
    1440,
    715,
    400,
    145,
    'reference/6-2.jpg',
    '無功 - 無為而萬物化',
    '聞在宥天下，不聞治天下也。在之也者，恐天下之淫 其性也;宥之也者，恐天下之遷其德也。天下不淫其性，不遷其德，有治天下者哉!'
        '聞在宥天下，不聞治天下也。在之也者，恐天下之淫其性也;宥之也者，恐天下之遷其德也。',
    """有一位名叫劉禹的賢明君王，他以其睿智和慈悲而聞名於世。有一天，一群臣子向劉禹進言，建議他加強統治力度，以更有效地治理國家。
然而，劉禹卻沉思片刻後說道：“我們不應該追求統治的權力，而是要專注於維持人民的本性和道德。如果我們專注於統治，可能會激起人民的反抗，導致天下淫蕩其性；而如果我們放任不管，則可能會讓人民的道德逐漸衰退。真正的治世者應該致力於維護人民的本性不淫蕩，保持人民的道德不動搖。”
劉禹的智慧和慈悲感動了所有的臣民，他們深深地明白了真正的治世之道，並紛紛向劉禹效忠。
這個故事告訴我們，真正的治世者不是專注於追求權力和統治，而是致力於維護人民的本性和道德。""",
  ),
  PopImage(
    1440,
    865,
    400,
    40,
    'reference/6-3.jpg',
    '無功 - 淵靜而百姓定',
    '鄰國相望，雞犬之聲相聞，民至老死不相往來',
    """雖然鄰國相隔不遠，但因為長期的戰爭或不和而導致民眾彼此之間幾乎沒有交流。儘管鄰國相望，雞犬的聲音能夠彼此聽到，但民眾卻因為種種原因而無法互相往來，甚至是到老死都沒有見過對方。
這段文字反映了兩個鄰國之間的敵對關係，導致了彼此之間的隔閡和交流的中斷。這種情況可能是由於長期的仇恨、戰爭、文化差異或政治問題所致。
在故事中，這樣的情況可能導致了兩個鄰國之間的疏離和對立，進一步加劇了兩國之間的敵意和不信任，甚至可能引發更多的衝突和戰爭。""",
  ),
  PopImage(
    1440,
    915,
    400,
    80,
    'reference/6-4.jpg',
    '無功 - 外化而內不化',
    '子之愛親，命也。臣之事君，義也。',
    """有一位名叫李平的年輕人，從小就受到父母的慈愛與教育。李平對父母的愛戀之情由衷，無私地孝順照顧他們，盡心盡力地履行著作為兒子的義務。
後來，李平被國王招募入宮為官，成為一名忠心耿耿的臣子。他竭盡全力，忠心耿耿地為國效力，不計得失地履行著作為臣子的義務，將國家利益置於首位。
李平的行為感動了國王和人民，他被譽為忠臣節義的典範。
這個故事告訴我們，對於父母的愛是天生的，是作為人的基本情感之一；而對於國家和君主的忠誠則是建立在道德義務之上，是作為一個成熟社會成員的責任。只有同時尊重家庭和社會的價值，才能實現個人和社會的和諧發展。""",
  ),

  // ### 7. 大美不言
  PopImage(
    1885,
    325,
    355,
    80,
    'reference/7-1.png',
    '大美不言 - 天地有大美而不言',
    '吾唯不知務而輕用吾身，吾是以亡足。今吾來也，猶有尊足者存，吾是以務全之也。夫天無不覆，地無不載，吾以夫子為天地，安知夫子之猶若是也!',
    """故事開始於一個古老的村莊，有一位叫做阿寶的年輕人，他生性懶散，喜歡在田野間游蕩，從不肯勞動。一天，他被一隻悍馬追趕，不慎跌入了陷阱，一隻腳被困在其中。
阿寶十分後悔自己過去的懶散，明白了珍惜身體的重要性。就在他絕望之時，一位老人及時趕到，救了他出來。
從此之後，阿寶改變了自己，努力工作，珍惜時間，並且關心身體健康。他明白了天地間萬物都有它承載和支撐的能力，所以他更加珍惜自己的生命。
這個故事告訴我們，要珍惜身體健康，不要輕視自己的身體。正如天地包容萬物，我們也應該珍惜生命中的每一刻，努力保護自己的健康。""",
  ),
  PopImage(
    1885,
    410,
    355,
    80,
    'reference/7-2.jpeg',
    '大美不言 - 大言不辯',
    '夫大道不稱，大辯不言，大仁不仁，大廉不謙，大勇不忮。道昭而不道，言辯而不及，仁常而不成，廉清而不信，勇忮而不成。五者無棄而幾向方矣。',
    """村中有一位年輕人叫做玄青，他很聰明，常常參加各種辯論比賽，以展現自己的口才和智慧。他的辯才令人驚嘆，但他卻缺乏真正的仁愛和廉潔，經常為了取勝而不擇手段。
有一天，玄青被邀請參加一場辯論比賽，他對自己的勝利信心滿滿。然而，在辯論的過程中，他的對手並沒有像他一樣大放厥詞，而是以平和的口吻談論著人與人之間的關懷和尊重，令在場的人感動不已。
最終，雖然玄青在辯論中取得了勝利，但他內心卻感到空虛和虧欠。他意識到，偉大的道理並不是靠辯論的多寡來展現，真正的仁愛和廉潔也不需要被強調和展現出來。他決心改變自己，更加注重內心的修養，而不是只追求口舌之勝。
這個故事告訴我們，偉大的品質並不是通過外在的言語和辯論來彰顯的，而是通過內在的修養和真誠的行為來體現的。在追求成功的過程中，我們不要忽略了內心的清淨和真誠，這才是最重要的。""",
  ),
  PopImage(
    1885,
    495,
    355,
    55,
    'reference/7-3.jpeg',
    '大美不言 - 大同無已',
    '大人之教,若形之於影,聲之於響.有問而應之,盡其所懷,為開下配.處乎無響,行乎無方。',
    """有一位名叫老李的村民，他是村中的賢人，也是大家都尊敬的長者。每當有人來向他請教問題時，老李總是耐心地聆聽，然後給予恰如其分的回答和指導。
有一天，一位村民的兒子向老李請教學習的問題，他提出了自己的困惑。老李細心聽取了他的問題，然後給予了準確的回答和建議，使得那位年輕人受益匪淺。
這個故事告訴我們，作為長者或是教師，我們應該像老李一樣，耐心倾听問題，給予恰如其分的回答和指導。只有這樣，才能真正地幫助到有問題的人，使他們得到正確的引導和教導。""",
  ),
  PopImage(
    1885,
    555,
    355,
    60,
    'reference/7-4.jpeg',
    '大美不言 - 黑鳥白鳥',
    '夫鵠不日浴而白，烏不日黔而黑。黑白之樸，不足以為辯;名譽之觀，不足以為廣。',
    """有一對兄弟，一個名叫白霄，一個名叫黑雲。白霄是個善良、正直的人，而黑雲則是個心機深沉、陰險狡詐的人。村民們常常以為白霄是個好人，因為他的名字是“白”，而對黑雲則持有戒心，因為他的名字是“黑”。
然而，隨著時間的推移，村民們發現，名字並不能代表一個人的品行。白霄雖然名字是白，但有時也會犯錯，而黑雲雖然名字是黑，但有時卻能做出善良的事情。於是，村民們明白了黑與白的簡單區分並不足以了解一個人，以名譽來觀察事物也不足以洞察其廣大之處。
這個故事告訴我們，不能單憑外表或名譽來判斷一個人，真正的了解需要深入內心，看清其品行和行為。""",
  ),
  PopImage(
    1885,
    620,
    355,
    70,
    'reference/7-5.jpeg',
    '大美不言 - 治之過也',
    '燒之剔之，刻之雒之，連之以羈馽，編之以皁棧，馬之死者十二三矣;飢之渴之，馳之驟之，整之齊之，前有橛飾之患，而後有鞭筴之威，而馬之死者已過半矣。',
    """國王命令將一批馬匹送往遠方作為禮物。馬夫們在途中不斷燒烤、剔除馬匹的毛髮、刻劃裝飾，並修補它們的傷口，以確保它們在旅途中狀態良好。
然而，這些馬匹在途中遇到了各種困難和挑戰，有的飢餓、口渴，有的快速奔跑，有的突然停頓。雖然馬夫們盡了全力照顧，但仍然有一半以上的馬匹在旅途中不幸喪命。
這個故事告訴我們，即使我們付出了很大的努力去照顧和保護，但在人生的旅途中，仍然會遇到各種不可預測的困難和挑戰。因此，我們應該時刻保持警覺，做好應對各種情況的準備，才能更好地應對生活的考驗。""",
  ),
  PopImage(
    1885,
    700,
    355,
    100,
    'reference/7-6.jpeg',
    '大美不言 - 道何在',
    '世俗之所謂知者，有不為大盜積者乎?所謂聖者，有不為大盜守者乎?盜亦有道?何適而無有道邪?夫妄意室中之藏，聖也。入先，勇也。出後，義也。知可否，知也。分均，仁也。',
    """有一位名叫劉禪的年輕人，他原本是一位知識分子，但因為家境貧困，生活艱難。某日，他聽說了城鎮裡有一位富商家中藏有大量的財寶，於是便萌生了偷竊之念。
劉禪深知這樣做是不對的，但出於生計的壓力和貪念，他還是決定冒險一搏。他精心策劃，潛入富商家中，成功地偷走了財寶。然而，當他離開後，心中卻充滿了愧疚和不安。
次日，劉禪將偷來的財寶平均分給了貧苦的鄉親，並且告訴他們這是一位善心人士捐贈給他們的。他這樣做是因為他明白了取得財富後，應該要將它用於正當的途徑，這才是仁慈的表現。
這個故事告訴我們，即使在做出錯誤的選擇後，也還有機會去改變自己，用行動來彌補錯誤。明智的人應該懂得正確對待所獲得的財富，並且用於造福社會。""",
  ),

  // ### 8. 棄聖止之
  PopImage(
    1885,
    970,
    355,
    80,
    'reference/8-1.jpeg',
    '棄聖止之 - 棄聖智天下平',
    '故絕聖棄智，大盜乃止;擿玉毁珠，小盗不起;焚符破璽，而民樸鄙;掊斗折衡，而民不爭，殚残天下之聖 法，而民始可與論議。',
    """有一位名叫柳白的智者，他以高超的智慧和睿智的見解聞名天下。然而，這個國度卻因為人們對柳白智慧的仰望而變得糜爛不堪，盜賊四起，社會秩序混亂。
有一天，柳白突然決定放棄自己的智慧，不再提供任何智慧給他人，而是隱居深山，遠離塵世。在柳白離開後，盜賊們失去了對智慧的追求，因為再沒有了可以引導他們的智者。盜賊們逐漸失去了對寶物的貪欲，而社會也變得安定。
人們看到柳白的舉動後，開始反思自己對智慧的追求是否正確，他們意識到，過度的追求智慧可能會導致社會的動盪和失序。因此，他們也放棄了對智慧的追求，轉而注重自己的內心修養和生活品質。
這個故事告訴我們，有時候過度的智慧並不能帶來社會的安定與和諧，甚至可能會導致更多的問題。在追求智慧的同時，我們也應該注意保持社會的平衡與和諧。""",
  ),
  PopImage(
    1885,
    1055,
    355,
    80,
    'reference/8-2.jpeg',
    '棄聖止之 - 使天下忘我難',
    '以敬孝易，以愛孝難;以愛孝易，以忘親難;忘親易，使親忘我難;使親忘我易，兼忘天下難;兼忘天下易，使天下兼忘我難。',
    """在這個村子裡，有一位年輕人名叫李文，他非常孝順，時刻尊敬著父母。李文以敬孝易，並且樂意為父母做任何事情。
然而，李文的父母卻不懂得以愛來孝順他，經常以嚴厲和苛刻的態度對待他。儘管如此，李文仍然用愛心對待父母，並忘記了他們的冷漠與苛刻。
後來，李文的父母因為一些事情離開了村子，他們的行為令村民們對他們感到不滿。然而，李文卻沒有因此而怨恨父母，而是繼續尊敬和愛戴他們。
最終，李文以其善良和包容的心，感染了整個村子，使每個人都能夠尊敬和愛護彼此，讓村子變得更加和諧與美好。
這個故事告訴我們，孝順父母不僅僅是要表現出尊敬和服從，更重要的是要用愛心來對待他們。只有以愛來孝順父母，才能真正達到忘我於愛的境界。""",
  ),
  PopImage(
    1885,
    1140,
    355,
    50,
    'reference/8-3.jpeg',
    '棄聖止之 - 井底蛙',
    '井蛙不可以語於海者，拘於虛也;夏蟲不可以語於冰 者，篤於時也;曲士不可以語於道者，束於教也',
    """一個古老的山間小村，有一只叫做小青的青蛙。小青非常喜歡探險，常常跳到小河邊，但從不敢跳進大海。有一天，一位好奇的小鳥問它為什麼不跳進海裡，小青回答道：“因為我拘束於虛弱，無法在海中生存。”
同時，村裡還住著一隻叫夏夜的螢火蟲。夏夜冬眠後在春天醒來，卻發現冰面上還是冰凍的，無法發出螢火。它向夏天到來的時間感到束手無策。
最後，還有一位名叫曲士的村民，他常常困惑於道德問題，但卻無法理解聖人的言論。他被教條所束縛，無法自由思考。
這個故事告訴我們，有時我們的行為受到自身能力、時機和思想觀念的限制。要實現真正的自由，就需要超越這些束縛，發揮自己的潛能，勇敢面對挑戰，並且開放心胸去理解和接納新的思想。""",
  ),
  PopImage(
    1885,
    1195,
    355,
    60,
    'reference/8-4.jpeg',
    '棄聖止之 - 知所為',
    '以養其知之所不知，終其天年而不中道夭者，是知之盛也。',
    """白鷺村中有一位年輕人名叫李明，他對世間萬物充滿了好奇心，時常研究各種知識和學問。李明不斷地學習，終其一生都在尋求新的知識，探索未知的領域。
然而，儘管李明學識渊博，卻始終未能領悟天道的真諦。他雖然對世間萬物有深入的了解，卻無法超越凡人的業力和生死輪回。
最後，李明終其一生都在不斷學習和追求知識，儘管他未能完全領悟天道，但他的追求和努力使他成為了村中的知識之士，受到村民的尊敬和欽佩。
這個故事告訴我們，人類的知識是有限的，即使是最博學的人也無法完全掌握宇宙的奧秘。然而，對於知識的不斷追求和學習，是一種對人類智慧的體現，也是一種對生命的尊重和珍惜。""",
  ),
  PopImage(
    1885,
    1260,
    355,
    38,
    'reference/8-5.jpeg',
    '棄聖止之 - 知所損',
    '夢飲酒者，旦而哭泣;夢哭泣者，旦而田獵。',
    """有兩個好友，一個名叫蔓，一個名叫蓼。蔓是一個愛好飲酒的人，他每天都喜歡在酒館裡飲酒作樂，但每次喝酒過量後，他都會情緒低落，哭泣不止。
而蓼則是一個感情豐富的人，他對世界充滿了熱愛和感慨，常常因為感動而流淚。然而，過了一會兒，他的情緒又會平靜下來，他會去田野裡狩獵，尋找自己的樂趣和發泄情緒的出口。
這個故事告訴我們，人的情感是多變且脆弱的，有時候一杯酒或一場感動都能引發不同的情緒。然而，重要的是在情緒起伏中保持平衡，找到合適的方式來排解情緒，尋求內心的寧靜與平和。""",
  ),
  PopImage(
    1885,
    1300,
    355,
    60,
    'reference/8-6.jpeg',
    '棄聖止之 - 知無用',
    '知無用而始可與言用矣，夫地非不廣且大也，然則無用之為用也亦明矣。',
    """有一位年輕的學者名叫梁明。他對於各種學問都有深入的研究，但他常常感到困惑，因為他無法將自己所學應用於實際生活中，覺得自己所學無用。
有一天，梁明遇到了一位老師爺，老師爺告訴他：“明白知識的無用才是真正的智慧。你所學雖然看似無用，但只有當你明白無用之處，才能夠將其轉化為有用之處。”
梁明深受啟發，開始重新審視自己所學的知識，發現了其中的價值所在。他開始將學問融入自己的言行之中，成為了一位能夠以知識指導人們生活的智者。
這個故事告訴我們，知識雖然有時候看似無用，但只有當我們明白其無用之處，才能夠真正將其應用於實際生活中，成為有價值的智慧。""",
  ),

  // ### 9. 心齋坐忘
  PopImage(
    600,
    1130,
    230,
    140,
    'reference/9-1.jpg',
    '心齋坐忘 - 心智專一用心不用耳',
    '庖丁為文惠君解牛，手之所觸，肩之所倚，足之所履，膝之所踦，砉然嚮然，奏刀騞然，莫不中音。合於桑林之舞，乃中經首之會。',
    """從前，在一個古老的村落裡，有一位名叫庖丁的廚師，他以解牛為生。一天，村中的文惠君找到了庖丁，請他幫忙處理一頭牛。庖丁答應了，於是他準備好了刀具，開始了解牛的工作。
庖丁的手法非常嫻熟，他輕輕觸摸著牛的身體，並將牛舒適地安置在位置上。他的肩膀靠在牛身上，步履間與牛保持著和諧的節奏，膝蓋微微蹲曲，刀勢瀟灑而又穩健。每一刀都落在準確的位置，牛的解剖工作順利進行，沒有出現任何意外。
村中的人們看到庖丁解牛的場景，都被他的技藝和舞姿所感動。他們意識到，庖丁不僅僅是一個普通的廚師，更是一位對於生命和自然充滿敬意的藝術家。
這個故事告訴我們，人應該像庖丁一樣，用心對待生活中的每一個細節，將工作與生活融為一體，追求內心的平和與和諧，尊重生命，感悟自然之美。""",
  ),
  PopImage(
    600,
    1275,
    230,
    100,
    'reference/9-2.jpg',
    '心齋坐忘 - 空明容物用氣不用心',
    '五六月累垸二而不墜，則失者錙 銖;累三而不墜，則失者十一; 累五而不墜，猶掇之也。',
    """在一個農村裡，有一位名叫阿貴的農夫。每年的五、六月，正是農忙時節，阿貴負責堆垸土以準備耕作。他努力工作，每次都能堆起一、二次的垸土而不失敗，只是偶爾會有一些農具遺失（錙銖），但這些損失對他來說並不算大。
然而，阿貴並沒有意識到這樣的損失會隨著垸土的累積而逐漸增加。到了第三次堆垸土時，失去的農具已經不止是少量，而是十一件。阿貴感到非常遺憾，但仍然沒有引起足夠的重視。
隨著時間的推移，到了第五次堆垸土時，阿貴已經失去了幾乎所有的農具，情況變得非常糟糕。他陷入了絕望之中，意識到自己的錯誤。
這個故事告訴我們，人們應該及時意識到問題的嚴重性，不要等到情況惡化才採取行動。累積的小失敗可能會帶來更大的後果，要及時警覺並採取適當的措施以防止事態惡化。""",
  ),
  PopImage(
    600,
    1395,
    230,
    100,
    'reference/9-3.jpg',
    '心齋坐忘 - 人間世',
    '汝不知夫螳螂乎?怒其臂以當車轍，不知其不勝任也，是其才之美者也。戒之，慎之，積伐而美者以犯之，幾矣!',
    """有一隻傲慢的螳螂，它自認為擁有無與倫比的力量和勇氣。一天，它看到一輛巨大的車子朝著它的方向開來，不屑一顧地認為自己足夠強大，可以用自己的臂膀阻擋車轍。
於是，螳螂怒氣沖沖地舉起了自己的臂膀，準備迎接車輪的沖擊。然而，當車輪碰到螳螂的臂膀時，螳螂發現自己的力量遠遠不及車輪的力量，它的臂膀被輾壓得支離破碎，最終螳螂受到了重傷。
螳螂痛苦地意識到自己的自負和愚蠢，後悔不已。而村莊的其他小動物們看到了這一幕，也從中汲取了教訓，明白了自己的能力和局限性，不再輕率行事。
這個故事告訴我們，即使是看似微小的生物，也可能因為自負和不明真相而遭受損失。我們應該謹慎對待自己的能力和局限性，避免因為自負而導致不可挽回的後果。""",
  ),
  PopImage(
    840,
    1130,
    250,
    60,
    'reference/9-4.jpg',
    '心齋坐忘 - 顔回坐忘',
    '墮肢體，黜聰明，離形去知，同於大通，此謂坐忘。',
    """樂樂自小聰明伶俐，深受村民們的喜愛和尊敬。然而，隨著年齡的增長，他漸漸感到了世俗生活的種種煩惱和束縛，內心產生了一種渴望解脫的強烈渴望。
於是，樂樂決定離開村子，獨自一人前往山中修行。在山中，他放下了對於物質生活的追求，不再計較名利地位，而是專心修習內心的冥想與冥思，放空了對於外在世界的掌控與干擾。
經過長時間的苦行修行，樂樂終於達到了一種境界，他墮落到肢體衰退，聰明才智漸次消逝，遠離了外在形式，並且摒棄了對知識的追求。然而，他的心靈卻與宇宙大道合一，達到了一種超凡脫俗的境界，這就是坐忘之境。
樂樂的修行故事告訴我們，有時候放下外在的追求與束縛，專注內心的冥想與冥思，反而能夠達到一種超越塵世的境界，實現心靈的自由與解放。""",
  ),
  PopImage(
    840,
    1195,
    250,
    110,
    'reference/9-5.jpg',
    '心齋坐忘 - 忘欲忘知',
    '文王觀於臧，見一丈夫釣，而其釣莫釣。非持其釣有釣者也，常釣也。',
    """在古老的臧地，有一個名叫陳平的漁夫，他以釣魚為生。每天清晨，陳平都會來到這個地方，輕輕地放下自己的釣竿，然後靜靜地等待。然而，人們總是看不到他手持任何魚餌，卻能看到他時常在這裡釣魚。
有一天，文王路過臧地，看到陳平在河邊釣魚，心生疑惑，於是上前詢問。陳平笑著解釋說：「君子，我這釣竿上雖無魚餌，但我常年以來在這裡釣魚，這已經成為了我的習慣和日常。魚們已經習慣了我的存在，我不需要魚餌，它們依然會上鉤。」
文王聽後恍然大悟，明白了陳平的用心之處。他領悟到，有些事情不僅僅需要堅持和耐心，更需要一份真誠和用心。陳平雖然沒有魚餌，但他的用心和耐心使得他成為了一名優秀的漁夫，這也正是文王所欣賞的。
這個故事告訴我們，有時候不必墨守成規，重要的是用心和耐心去堅持自己的目標，並且相信自己的努力終將得到回報。""",
  ),
  PopImage(
    840,
    1320,
    250,
    90,
    'reference/9-6.jpg',
    '心齋坐忘 - 忘己忘治',
    '幾矣，雞雖有鳴者，已無變矣，望之似木雞矣，其德全矣。異雞無敢應者，反走矣。',
    """在一個農家裡，有一隻名叫小紅的雞，它從小就以啼叫聞名。每天清晨，小紅總是第一隻啼叫的雞，叫聲清脆動聽，引來了許多其他雞群的回應。
然而，隨著時間的流逝，其他雞漸漸發現，雖然小紅的叫聲依然清脆，但已經失去了變化，每天都是一成不變的叫聲，缺乏新意。於是，它們漸漸對小紅的叫聲失去了興趣，甚至開始覺得厭煩。
雖然小紅的德行仍然完整，但其他雞不敢再與它應和，而是選擇了逃跑，尋找更加有趣的事物。
這個故事告訴我們，即使在某一方面表現出色，但如果缺乏變化和新意，就可能失去他人的關注和信任。因此，我們應該不斷地學習和改進自己，保持新鮮感，以吸引他人的注意和尊重。""",
  ),

  // ### 10. 六步六境
  PopImage(
    1240,
    1130,
    280,
    75,
    'reference/10-1.jpg',
    '六步六境 - 適性不忘本',
    '澤雉十步一啄，百步一飲，不蘄畜乎樊中。神雖王，不善也。',
    """在一個農家裡，有一隻名叫小紅的雞，它從小就以啼叫聞名。每天清晨，小紅總是第一隻啼叫的雞，叫聲清脆動聽，引來了許多其他雞群的回應。
然而，隨著時間的流逝，其他雞漸漸發現，雖然小紅的叫聲依然清脆，但已經失去了變化，每天都是一成不變的叫聲，缺乏新意。於是，它們漸漸對小紅的叫聲失去了興趣，甚至開始覺得厭煩。
雖然小紅的德行仍然完整，但其他雞不敢再與它應和，而是選擇了逃跑，尋找更加有趣的事物。
這個故事告訴我們，即使在某一方面表現出色，但如果缺乏變化和新意，就可能失去他人的關注和信任。因此，我們應該不斷地學習和改進自己，保持新鮮感，以吸引他人的注意和尊重。""",
  ),
  PopImage(
    1240,
    1210,
    280,
    130,
    'reference/10-2.jpg',
    '六步六境 - 喜怒不入心',
    '夫忿滀之氣，散而不反，則為不足;上而不下，則使人善怒;下而不上，則使人善忘;不上不下，中身當心，則為病。',
    """有一位名叫王子的年輕人，他心中常常充滿了忿怒之氣。每當遇到一些小事情，他就會立刻發脾氣，甚至對身邊的人大聲呵斥。
王子的忿怒之氣並不是一次兩次，而是持續不斷地散發出來，卻從來沒有反思過自己的行為。他的父親常常勸告他要控制自己的情緒，但他總是置之不理。
隨著時間的推移，王子的忿怒之氣越來越嚴重，使他周圍的人都感到不安。有一天，王子因為一件小事情而大發雷霆，結果傷害了身邊的一位朋友。這一幕讓王子終於意識到了自己的錯誤，他開始反省自己的行為，努力控制自己的情緒。
經過努力，王子終於學會了如何控制自己的忿怒之氣，並且成為了一個成熟、冷靜的人。
這個故事告訴我們，忿怒之氣如果無法適當地控制，就會給自己和周圍的人帶來傷害。我們應該學會冷靜地面對問題，控制自己的情緒，避免因為一時的衝動而做出後悔的事情。""",
  ),
  PopImage(
    1240,
    1345,
    280,
    90,
    'reference/10-3.jpg',
    '六步六境 - 萬物一体侍',
    '至人之用心若鏡，不將不迎，應而不藏，故能勝物而不傷。',
    """有一位名叫蕭風的智者，被村民們尊稱為至人。蕭風平日裡總是心無旁騖，專心致志地修行著，他的內心就如同一面明鏡，能夠清晰地反映出周遭的世界。
有一次，山村遭受了嚴重的旱災，田地枯竭，村民們陷入了絕望之中。蕭風看到了村民們的困境，立即伸出援手，給予他們幫助和支持。他用自己的智慧和慈悲之心，引導村民們共同度過了難關。
雖然蕭風身為至人，擁有著非凡的智慧和力量，但他從不將自己的能力和慷慨展示給他人，而是默默地為村民們做出貢獻。他的心靈純淨無瑕，如同明鏡般，不將自己的善行藏匿起來，而是毫無保留地展現給世人。
蕭風的故事告訴我們，真正的至人擁有一顆純淨無私的心，能夠應對世間的種種挑戰，勝過物質，卻不會傷害他人。我們應該向蕭風一樣，保持一顆清澈透明的心，用真摯的愛和慈悲之心去關懷他人，共同創造美好的世界。""",
  ),
  PopImage(
    1525,
    1130,
    280,
    110,
    'reference/10-4.jpg',
    '六步六境 - 死生不為擾',
    '死，無君於上，無臣於下;亦無四時之事，從然以天地為春秋，雖南面王樂，不能過也。',
    """有一位名叫明王的君主，他統治著一個龐大的帝國。明王擁有無上的權力和地位，人們都對他敬畏有加。
然而，就在一天，明王突然感染了一種罕見的疾病，命懸一線。明王嘗盡了各種方法，卻無法擺脫疾病的纏繞，最終不幸離世了。
在明王去世後，人們對他的悲傷之情溢於言表，但同時也意識到了一個殘酷的現實：無論明王的地位多麼高尚，面對死亡，他也無法超越生命的規律。
從此以後，人們更加珍惜生命，明白到死亡是每個人都無法避免的命運。他們決定放下權力和地位的慾望，將更多的精力放在珍惜當下，關愛親人和朋友上。
這個故事告訴我們，無論地位高下，面對死亡，每個人都是平等的，沒有人能夠逃脫。我們應該珍惜眼前的時光，好好地生活，珍惜與親人朋友的相處。""",
  ),
  PopImage(
    1525,
    1245,
    280,
    130,
    'reference/10-5.jpg',
    '六步六境 - 禍福不足憂',
    '白刃交於前，視死若生者，烈士之勇也;知窮之有命，知通之有時，臨大難而不懼者，聖人之勇也。',
    """有一位名叫劉備的將軍，他帶領著一支勇敢的軍隊，與敵人展開了激烈的戰鬥。在一場關鍵的戰役中，劉備率領的軍隊遭遇到了強大的敵人，處於極度危險之中。
然而，即使在生死關頭，劉備仍然保持著鎮定和果敢。他挺身而出，率先衝入敵陣，與敵人展開了激烈的白刃戰。儘管劍光刀影交錯，生死存亡之際，但劉備卻毫不畏懼，將死視同生，展現出了烈士之勇。
在另一個場景中，當劉備面臨著政治上的重大挑戰和困難時，他依然堅定不移，保持著信念和勇氣。儘管處於極大的壓力之下，但劉備從不退縮，以聖人之勇面對著眼前的困難和挑戰。
這個故事告訴我們，面對生死和困難，我們應該像劉備一樣保持堅定的勇氣和信念。即使面對著極大的困難和逆境，我們也應該勇敢地迎接挑戰，將死視同生，堅持不懈地追求自己的目標和理想。""",
  ),
  PopImage(
    1525,
    1380,
    280,
    85,
    'reference/10-6.jpg',
    '六步六境 - 逍遙自由身',
    '此龜者，寧其死為留骨而貴乎?寧 其生而曳尾於塗中乎?',
    """在一個遙遠的湖畔，有一隻名叫阿龜的小龜，它生活在一片美麗的湖泊中，享受著陽光和清新的空氣。然而，一天，湖水暴漲，湖畔的泥濘地區淹沒了大部分的植被，阿龜也因此陷入了困境。
阿龜發現自己被困在了一片泥濘中，無法自拔。它努力地掙扎著，但每一次都只是徒勞無功。它開始感到絕望，思考著自己的處境。
就在這時，一隻鷺鷥飛過來，看到了阿龜的困境。鷺鷥問道：“阿龜，你願意留在這裡，讓自己的龜殼成為寶貴的遺骨，還是希望活著，但在泥濘中曳尾艱難前行呢？”
阿龜沉思片刻，最終做出了選擇。它說：“我願意活著，即使在泥濘中曳尾前行，我也不願意放棄生命的希望。只要我還活著，就有機會重新找到屬於我的天地。”
於是，阿龜努力地挪動著身體，一步步地向前行去。儘管路途艱難，但它始終沒有放棄，最終成功地脫離了泥濘的困境，重新找到了自己的家園。
這個故事告訴我們，面對困境和挑戰，我們應該像阿龜一樣，堅持不懈，勇敢地面對，永遠不要放棄對生命的希望和對未來的信心。""",
  ),

  // ### 11. 無為守本
  PopImage(
    140,
    410,
    340,
    60,
    'reference/11-1.jpg',
    '無為守本 - 不要不自量力',
    '汝不知夫螳螂乎?怒其臂以當車轍，不知其不勝任 也，是其才之美者也。',
    """有一隻小小的螳螂，名叫小螳。雖然體型微小，但它卻擁有著勇敢的心。一天，小螳遇到了一隻巨大的驅車蟲，它正沿著小徑緩緩前行。
小螳看到了驅車蟲，並沒有退縮，反而挺身而出。它舉起雙臂，怒視著驅車蟲，準備迎戰。驅車蟲看到這個微不足道的小小生物竟然敢挑戰自己，不禁感到有些詫異，但仍然毫不畏懼地繼續前進。
小螳毫不畏懼地向驅車蟲發起了攻擊，用自己的小小身軀與驅車蟲交戰。儘管體型微小，但它表現出的堅定和勇氣卻讓人驚訝。最終，小螳雖然無法戰勝驅車蟲，但它卻贏得了大家的尊重和讚賞。
這個故事告訴我們，即使面對比自己強大的敵人，我們也應該像小螳一樣，保持自信和勇氣，奮勇向前，不要輕易退縮。在生活中，勇敢和自信是克服困難的關鍵，只有敢於面對挑戰，才能戰勝困難，取得成功。""",
  ),
  PopImage(
    140,
    475,
    340,
    70,
    'reference/11-2.jpg',
    '無為守本 - 不要違本性',
    '汝不知夫養虎者乎?不敢以生物與之，為其殺之之怒 也;不敢以全物與之，為其決之之怒也;時其飢飽，達其怒心。',
    """在一個遙遠的山脈深處，有一個古老的寺廟，寺廟的後山有一個荒涼的山谷，裡面棲息著一隻兇猛的老虎。這隻老虎曾經是一位名叫李白的寺廟僧人所救，從此便與寺廟結下了因果。
寺廟的主持每天都會親自前往山谷給老虎供食，但卻不敢太靠近。因為一旦激怒了老虎，後果不堪設想。有一次，一位遊客來到寺廟，好奇地詢問主持為什麼不放生老虎。主持淡淡地回答：“你不知道養虎之患。若是生擒獻祭，會激怒它的殺意；若是供給過多，會滿足它的胃口，讓它變得更加兇猛。我們必須時刻注意虎的飽食程度，避免激怒它的怒火。”
遊客聽後深受啟發，意識到了人性的貪婪和欲望的危險。他明白了要時刻保持克制，避免激怒內心的怒火，才能夠遠離災難，享受平靜與安寧。
這個故事告訴我們，人心如同養虎，若是任其放縱，就會變得越來越凶猛。我們應該時刻警惕，控制自己的慾望，避免陷入無法挽回的境地。""",
  ),
  PopImage(
    140,
    550,
    340,
    70,
    'reference/11-3.jpeg',
    '無為守本 - 不要溺愛',
    '夫愛馬者以筐盛矢，以蜄盛溺，適有蚊虻僕緣，而拊之不時，則缺銜毀首碎胸。意有所至，而愛有所亡，可不慎耶?',
    """有一位名叫李易的年輕人，是村裡最優秀的騎士之一，他對自己的馬情有獨鍾，每天都花很多時間和精力來照顧馬匹。
李易的馬是他從小養大的，彼此之間有著深厚的情感。然而，李易的愛護之心有時卻讓他過度放縱。他總是用緞帶為馬妝飾，給予馬匹過多的糧食，甚至還常常給馬匹糖果等美食。
有一天，李易騎著他心愛的馬出去遊玩，不慎遇到了一群蚊虻。馬匹因為受到了蚊虻的騷擾，情緒變得不穩，李易卻不停地用手拍打馬匹，希望趕走蚊虻。
然而，李易的不慎卻導致了意外的發生。他的過度愛護讓馬匹感到壓力，加上他的不停拍打，馬匹感到恐懼和緊張，最終失控，造成了嚴重的事故，讓李易的馬傷及毀損。
這個故事告訴我們，雖然愛護之心是善意的，但也需要謹慎對待，避免過度放縱而導致不幸的結果。我們應該學會適當地愛護和呵護，而不是過度擁戴，以免給所愛之物帶來傷害。""",
  ),
  PopImage(
    140,
    625,
    340,
    80,
    'reference/11-4.jpeg',
    '無為守本 - 無功不受祿',
    '知足者，不以利自累也。廢上，非義也;殺民，非仁也;人犯其難，我享 其利，非謙也。',
    """一位名叫張富的富商，他擁有眾多的財富和土地，但他的心卻始終不安寧。每天他都在追逐更多的財富和地位，不顧一切地追求個人利益。
有一天，村莊裡發生了一場大火，許多房屋被燒毀，村民們無家可歸。張富看到這種情況，卻毫不在乎，反而暗自高興，因為這意味著他可以趁機買下更多的土地，擴大自己的財富。
然而，這樣的行為卻讓村民們感到憤怒和不滿。他們指責張富不顧他人的困難，只顧自己的利益，是一個貪婪自私的人。
最終，張富意識到了自己的錯誤。他明白了知足的重要性，意識到追求個人利益而忽略了他人的需要是一種自私自利的行為。從此以後，他決心改變自己，更加注重義理和謙虛，努力做一個有益於社會的人。
這個故事告訴我們，知足是一種美德，追求個人利益的過度會導致道德沉淪和社會不公。我們應該學會懂得知足，尊重義理，謙虛待人，這樣才能夠獲得真正的幸福和滿足。""",
  ),
  PopImage(
    140,
    710,
    340,
    42,
    'reference/11-5.jpeg',
    '無為守本 - 聖人亡人國而不失人心',
    '聖人之用兵也，亡國而不失人心。',
    """有一位被人尊稱為聖人的君王，他以仁義之心治理著國家，深得人民的愛戴和信任。一天，國家面臨了來自外敵的威脅，聖人不得不率領軍隊出征。
儘管聖人和他的軍隊勇敢地抵抗，但最終他們還是戰敗了，國土被侵略者佔領。然而，即使國土失去了，聖人的人民依然支持著他，並堅信他會帶領國家走出困境。
聖人沒有因為失去國土而放棄，反而更加努力地與人民共同重建國家，最終取得了國家的發展和繁榮。人民對聖人的信任和支持，成為了他成功的力量源泉。
這個故事告訴我們，一個真正的領導者不僅在順境中受人尊敬，更是在逆境中得到人民的信任和支持。即使面臨挑戰和失敗，聖人也能夠堅持仁義之道，不失人心，最終實現國家的興盛和人民的幸福。""",
  ),
  PopImage(
    140,
    755,
    340,
    70,
    'reference/11-6.jpeg',
    '無為守本 - 聖人觀予天下而不助',
    '故聖人觀於天而不助，成於德而不累，出於道而不謀，會於仁而不恃，薄於義而不積，應於禮而不諱，接於事而不辭，齊於法而不亂，恃於民而不輕，因於物而不去。',
    """有一位被譽為聖賢的君主，他以其高尚的品德和卓越的治國智慧獲得了人民的愛戴和尊敬。他不追求名利，不貪圖享樂，而是專注於修身養德，以德行感召人心，使國家充滿和諧與安寧。
聖賢君主親近天命，信仰天意，堅信一切皆由天意安排，不依賴外力助成。他通過崇尚德行，示範著正確的行為方式，不給人民增加負擔，反而鼓勵他們向德行努力。他以道義為依歸，行事合乎道德準則，不為私利所動，而是為了國家和人民的福祉著想。他以仁愛感召人心，不倚賴權力強制，而是用慈愛和關懷溫暖人心，贏得了人民的真心支持。
這位聖賢君主以其卓越的智慧和崇高的品德，實踐了治國的八項原則，使國家充滿了和諧與穩定，繁榮昌盛，人民生活安康幸福。
這個故事告訴我們，作為領導者，要以德行和仁愛感召人心，堅守道德原則，依循禮儀法度，並與民眾真誠相待，才能建立一個和諧、穩定、繁榮的社會。""",
  ),

  // ### 12. 三劍四患
  PopImage(
    140,
    1000,
    340,
    210,
    'reference/12-1.jpeg',
    '三劍四患 - 三劍三戰',
    '天子劍,直之無前，舉之無上，案之無下，運之無旁，上決浮雲，下絕地紀。此劍一用，匡諸侯，天下服矣。'
        '諸侯劍，直之亦無前，舉之亦無上，案之亦無下，運之亦無旁;上法圓天以順三光，下法方地以順四時，中和 民意以安四鄉。此劍一用，如雷霆之震也，四封之內，無不賓服而聽從君命者矣。'
        '庶人劍，蓬頭突鬢垂冠，曼胡之纓，短後之衣，瞋目而 語難。相擊於前，上斬頸領，下決肝肺。此庶人之劍， 無異於鬥雞，一旦命已絕矣，無所用於國事。',
    """在古代的一個國家裡，有一位強大的天子統治著全國，他手握著天子劍，象徵著至高無上的權威和統治力量。這把劍鋒利無比，一挥之間可使敵人退卻，國家安定。
與天子並駕齊驅的是諸侯們，他們各自擁有一把諸侯劍，也是象徵著權威和統治力量。這些劍直刺天穹，舉之如山，案之如地，運之如風。諸侯們以法圓天、方地，順應自然的法則，使其領土繁榮昌盛，人民安居樂業。
而庶民則使用著庶人劍，這些劍雖然也有鋒利的刀鋒，但卻是用來維護個人的生活和安全。庶人劍常常被用來處理日常生活中的糾紛，但在國家大事上，卻無法發揮作用，只能作為無助的旁觀者。
這個故事告訴我們，不同階層的人有著不同的責任和使命，他們所使用的劍也反映了他們的身份和地位。在國家的建設和發展中，每個人都有自己的角色和貢獻，只有共同努力，才能實現國家的繁榮昌盛。""",
  ),
  PopImage(
    140,
    1213,
    340,
    83,
    'reference/12-2.jpeg',
    '三劍四患 - 識人九要',
    '遠使之而觀其忠，近使之而觀其敬，煩使之而觀其能，卒然問焉而觀其知，急與之期而觀其信，委之以財而觀其仁，告之以危而觀其節，醉之以酒而觀其側，雜之以處而觀其色。',
    """在一個古老的王國裡，有一位賢明的國王，他想要找到一位能夠擔任重要職位的官員。為了確保選擇合適的人選，國王採取了多種方式來觀察候選人的表現。
首先，國王安排了一些違反常規的事情，觀察候選人對待這些情況時的忠誠和態度。接著，他將候選人安排在身邊，近距離觀察他們的敬意和應對能力。然後，他給候選人一些煩瑣的任務，觀察他們的能力和反應。接下來，國王突然提出一個問題，觀察候選人的知識水平。接著，他設定了一個緊迫的期限，觀察候選人的信任度。然後，國王將財富委託給候選人，觀察他們的仁慈和誠實。接著，他故意製造一些危險情況，觀察候選人的節操和應對能力。最後，國王用酒將候選人灌醉，觀察他們在酒醉狀態下的表現。同時，國王也觀察候選人在不同場合下的表情和態度。
通過這些觀察，國王最終找到了一位表現優異的官員，他忠誠、敬重、能力出眾、知識豐富、信任度高、仁慈正直、節操堅守、性格穩重。
這個故事告訴我們，要選擇一個合適的人選，需要從多個方面來考察他們的表現和品質，而不是僅僅看表面的榮耀或外在的表現。""",
  ),
  PopImage(
    140,
    1300,
    340,
    90,
    'reference/12-3.jpeg',
    '三劍四患 - 八病',
    '非其事而事之，謂之摠;莫之顧而進之，謂之佞;希意 道言，謂之諂;不擇是非而言，謂之諛;好言人之惡，謂之讒;'
        '析交離親，謂之賊;稱譽詐偽以敗惡人，謂之 慝;不擇善否，兩容頰適，偷拔其所欲，謂之險。',
    """有一個權勢猖獗的宮廷，裡面充斥著各種陰謀詭計。有一位宮廷大臣，名叫王忠，他總是以不正當的手段來爭取權力和地位。
王忠經常對一些不相干的事情進行干涉，這就是所謂的「撼」。他也常常虛偽地奉承君王，做出一些不切實際的建議，這就是所謂的「佞」。而他也善於溜顯低下，口若懸河，來奉承權貴，這就是所謂的「諂」。
另外，王忠還善於以甜言蜜語來討好人心，對於是非曲直卻不加以探究，這就是所謂的「諛」。他還經常誹謗他人，以此來毀壞他人的名譽，這就是所謂的「讒」。王忠也不擇手段地與親人朋友為敵，這就是所謂的「賊」。
此外，他還會以虛假的稱譽來誘使別人掉入陷阱，這就是所謂的「感」。最後，他還善於兩面派，對人表面上容忍規適，實則心懷不軌，這就是所謂的「險」。
這個故事告訴我們，要警惕身邊的人是否有類似王忠的行為，並且要識破他們的詭計，保護自己和國家的利益。""",
  ),
  PopImage(
    140,
    1393,
    340,
    75,
    'reference/12-4.jpeg',
    '三劍四患 - 四患',
    '好經大事，變更易常，以掛功名，謂之叨;專知擅事，侵人自用，謂之貪;見過不更，聞諫愈甚，謂之很; 人同於己則可，不同於己，雖善不善，謂之矜。',
    """有一位名叫李德的大臣，他一直以來都渴望著獲得榮譽和功名，因此他經常以種種手段來追求名利，這就是所謂的「叨」。無論是透過諂媚奉承還是利用權勢來取悅君王，李德都不擇手段，希望藉此獲得更高的地位和尊重。
然而，隨著時間的推移，李德的貪心日益膨脹，他開始專擅事務，不顧他人的利益和感受，只為了滿足自己的私慾，這就是所謂的「貪」。他不僅佔有他人的財富和權力，甚至還破壞了人們之間的和諧關係，讓眾人感到不滿。
而當有人指出他的錯誤時，李德卻固執己見，拒絕改正，即使他已經犯了錯誤，也不願意承認，這就是所謂的「很」。他甚至以自己的行為來自傲，認為自己無所不知，是無所不能的，這就是所謂的「矜」。
最終，李德因為自己的貪婪和固執，失去了人們對他的尊敬和信任，最終遭受了悲慘的下場。這個故事告訴我們，貪婪、固執和自負是不可取的品質，只有謙虛和正直才能獲得他人的尊重和信任。""",
  ),
];

/* 參考標題
1. 消遙遊子
1.1 逍遙似巨棚展翅天際
1.2 逍遙似列子御風而行
1.3 逍遙似姑射山神人游乎四海
1.4 逍遙似許由不受天下

2. 莊子心性
2.1 入故無情
2.2 得斗升之水然活
2.3 生而曳尾于塗中
2.4 物化
2.5 生死為四時行
2.6 以天地為棺槨

3. 孔老之辯
3.1 忘物忘天忘己
3.2 放德而行
3.3 逍遙苟簡不貸
3.4 三皇五帝之辯
3.5 六經之辯
3.6 至美至樂

4. 遊心
4.1 齊物我
4.2 齊譽非
4.3 齊禍福
4.4 齊生死

5. 無名
5.1 為善無近名
5.2 為混沌開七竅
5.3 殉利殉名殉家殉天下
5.4 忠未必信孝未必愛

6. 無功
6.1 無欲而天下足
6.2 無為而萬物化
6.3 淵靜而百姓定
6.4 外化而內不化

7. 大美不言
7.1 天地有大美而不言
7.2 大言不辯
7.3 大同無已
7.4 黑鳥白鳥
7.5 治之過也
7.6 道何在

8. 棄聖止之
8.1 棄聖智天下平
8.2 使天下忘我難
8.3 井底蛙
8.4 知所為
8.5 知所損
8.6 知無用

9. 心齋坐忘
9.1 心智專一用心不用耳
9.2 空明容物用氣不用心
9.3 人間世
9.4 顔回坐忘
9.5 忘欲忘知
9.6 忘己忘治

10. 六步六境
10.1 適性不忘本
10.2 喜怒不入心
10.3 萬物一体侍
10.4 死生不為擾
10.5 禍福不足憂
10.6 逍遙自由身
10.7 朝彻見獨

11. 無為守本
11.1 不要不自量力
11.2 不要違本性
11.3 不要溺愛
11.4 無功不受祿
11.5 聖人亡人國而不失人心
11.6 聖人觀予天下而不助

12. 三劍四患
12.1 三劍三戰
12.2 識人九要
12.3 八病
12.4 四患
*/
